TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.1.LTS *
       3              ;* Date/Time created: Wed Jan 04 15:50:39 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/drivers/drvic/drv8305/src/32b/f
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.1.LTS Copyright (c) 1996-2015
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8012              $C$DW$663       .dwtag  DW_TAG_enumerator
    8013                      .dwattr $C$DW$663, DW_AT_name("Address_Control_C")
    8014                      .dwattr $C$DW$663, DW_AT_const_value(0x6000)
    8015              
    8016                      .dwendtag $C$DW$T$181
    8017              
    8018              $C$DW$T$182     .dwtag  DW_TAG_typedef
    8019                      .dwattr $C$DW$T$182, DW_AT_name("DRV8305_Address_e")
    8020                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$181)
    8021                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    8022              
    8023              $C$DW$664       .dwtag  DW_TAG_TI_far_type
    8024                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$182)
    8025              
    8026              $C$DW$T$183     .dwtag  DW_TAG_const_type
    8027                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$664)
    8028              
    8029              
    8030              $C$DW$T$184     .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  153

    8031                      .dwattr $C$DW$T$184, DW_AT_byte_size(0x01)
    8032              $C$DW$665       .dwtag  DW_TAG_enumerator
    8033                      .dwattr $C$DW$665, DW_AT_name("DcCalMode_Ch1_Load")
    8034                      .dwattr $C$DW$665, DW_AT_const_value(0x00)
    8035              
    8036              $C$DW$666       .dwtag  DW_TAG_enumerator
    8037                      .dwattr $C$DW$666, DW_AT_name("DcCalMode_Ch1_NoLoad")
    8038                      .dwattr $C$DW$666, DW_AT_const_value(0x100)
    8039              
    8040              $C$DW$667       .dwtag  DW_TAG_enumerator
    8041                      .dwattr $C$DW$667, DW_AT_name("DcCalMode_Ch2_Load")
    8042                      .dwattr $C$DW$667, DW_AT_const_value(0x00)
    8043              
    8044              $C$DW$668       .dwtag  DW_TAG_enumerator
    8045                      .dwattr $C$DW$668, DW_AT_name("DcCalMode_Ch2_NoLoad")
    8046                      .dwattr $C$DW$668, DW_AT_const_value(0x200)
    8047              
    8048              $C$DW$669       .dwtag  DW_TAG_enumerator
    8049                      .dwattr $C$DW$669, DW_AT_name("DcCalMode_Ch3_Load")
    8050                      .dwattr $C$DW$669, DW_AT_const_value(0x00)
    8051              
    8052              $C$DW$670       .dwtag  DW_TAG_enumerator
    8053                      .dwattr $C$DW$670, DW_AT_name("DcCalMode_Ch3_NoLoad")
    8054                      .dwattr $C$DW$670, DW_AT_const_value(0x400)
    8055              
    8056                      .dwendtag $C$DW$T$184
    8057              
    8058              $C$DW$T$185     .dwtag  DW_TAG_typedef
    8059                      .dwattr $C$DW$T$185, DW_AT_name("DRV8305_CTRL0A_DcCalMode_e")
    8060                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$184)
    8061                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    8062              
    8063              $C$DW$671       .dwtag  DW_TAG_TI_far_type
    8064                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$185)
    8065              
    8066              $C$DW$T$186     .dwtag  DW_TAG_const_type
    8067                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$671)
    8068              
    8069              
    8070              $C$DW$T$187     .dwtag  DW_TAG_enumeration_type
    8071                      .dwattr $C$DW$T$187, DW_AT_byte_size(0x01)
    8072              $C$DW$672       .dwtag  DW_TAG_enumerator
    8073                      .dwattr $C$DW$672, DW_AT_name("ShuntAmpNumber_1")
    8074                      .dwattr $C$DW$672, DW_AT_const_value(0x01)
    8075              
    8076              $C$DW$673       .dwtag  DW_TAG_enumerator
    8077                      .dwattr $C$DW$673, DW_AT_name("ShuntAmpNumber_2")
    8078                      .dwattr $C$DW$673, DW_AT_const_value(0x02)
    8079              
    8080              $C$DW$674       .dwtag  DW_TAG_enumerator
    8081                      .dwattr $C$DW$674, DW_AT_name("ShuntAmpNumber_3")
    8082                      .dwattr $C$DW$674, DW_AT_const_value(0x03)
    8083              
    8084                      .dwendtag $C$DW$T$187
    8085              
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  154

    8086              $C$DW$T$188     .dwtag  DW_TAG_typedef
    8087                      .dwattr $C$DW$T$188, DW_AT_name("DRV8305_ShuntAmpNumber_e")
    8088                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$187)
    8089                      .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    8090              
    8091              $C$DW$675       .dwtag  DW_TAG_TI_far_type
    8092                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$188)
    8093              
    8094              $C$DW$T$189     .dwtag  DW_TAG_const_type
    8095                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$675)
    8096              
    8097              
    8098              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    8099                      .dwattr $C$DW$T$26, DW_AT_name("_DRV8305_Obj_")
    8100                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    8101              $C$DW$676       .dwtag  DW_TAG_member
    8102                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$20)
    8103                      .dwattr $C$DW$676, DW_AT_name("spiHandle")
    8104                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_spiHandle")
    8105                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8106                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    8107              
    8108              $C$DW$677       .dwtag  DW_TAG_member
    8109                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$22)
    8110                      .dwattr $C$DW$677, DW_AT_name("gpioHandle")
    8111                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_gpioHandle")
    8112                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8113                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    8114              
    8115              $C$DW$678       .dwtag  DW_TAG_member
    8116                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$24)
    8117                      .dwattr $C$DW$678, DW_AT_name("gpioNumber")
    8118                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_gpioNumber")
    8119                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8120                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    8121              
    8122              $C$DW$679       .dwtag  DW_TAG_member
    8123                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$25)
    8124                      .dwattr $C$DW$679, DW_AT_name("RxTimeOut")
    8125                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_RxTimeOut")
    8126                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8127                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    8128              
    8129              $C$DW$680       .dwtag  DW_TAG_member
    8130                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$25)
    8131                      .dwattr $C$DW$680, DW_AT_name("enableTimeOut")
    8132                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_enableTimeOut")
    8133                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8134                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    8135              
    8136                      .dwendtag $C$DW$T$26
    8137              
    8138              $C$DW$T$192     .dwtag  DW_TAG_typedef
    8139                      .dwattr $C$DW$T$192, DW_AT_name("DRV8305_Obj")
    8140                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  155

    8141                      .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    8142              
    8143              $C$DW$T$109     .dwtag  DW_TAG_pointer_type
    8144                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$26)
    8145                      .dwattr $C$DW$T$109, DW_AT_address_class(0x20)
    8146              
    8147              $C$DW$T$110     .dwtag  DW_TAG_typedef
    8148                      .dwattr $C$DW$T$110, DW_AT_name("DRV8305_Handle")
    8149                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    8150                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    8151              
    8152              $C$DW$681       .dwtag  DW_TAG_TI_far_type
    8153                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$110)
    8154              
    8155              $C$DW$T$193     .dwtag  DW_TAG_const_type
    8156                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$681)
    8157              
    8158              
    8159              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    8160                      .dwattr $C$DW$T$33, DW_AT_name("_DRV_SPI_8305_Ctrl05_t_")
    8161                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    8162              $C$DW$682       .dwtag  DW_TAG_member
    8163                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$28)
    8164                      .dwattr $C$DW$682, DW_AT_name("IDRIVEP_HS")
    8165                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_IDRIVEP_HS")
    8166                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8167                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    8168              
    8169              $C$DW$683       .dwtag  DW_TAG_member
    8170                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$30)
    8171                      .dwattr $C$DW$683, DW_AT_name("IDRIVEN_HS")
    8172                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_IDRIVEN_HS")
    8173                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8174                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    8175              
    8176              $C$DW$684       .dwtag  DW_TAG_member
    8177                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$32)
    8178                      .dwattr $C$DW$684, DW_AT_name("TDRIVEN")
    8179                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_TDRIVEN")
    8180                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8181                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    8182              
    8183              $C$DW$685       .dwtag  DW_TAG_member
    8184                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$25)
    8185                      .dwattr $C$DW$685, DW_AT_name("CTRL05_RSV1")
    8186                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_CTRL05_RSV1")
    8187                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8188                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    8189              
    8190                      .dwendtag $C$DW$T$33
    8191              
    8192              $C$DW$T$86      .dwtag  DW_TAG_typedef
    8193                      .dwattr $C$DW$T$86, DW_AT_name("DRV_SPI_8305_Ctrl05_t_")
    8194                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$33)
    8195                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  156

    8196              
    8197              
    8198              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8199                      .dwattr $C$DW$T$40, DW_AT_name("_DRV_SPI_8305_Ctrl06_t_")
    8200                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    8201              $C$DW$686       .dwtag  DW_TAG_member
    8202                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$35)
    8203                      .dwattr $C$DW$686, DW_AT_name("IDRIVEP_LS")
    8204                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_IDRIVEP_LS")
    8205                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8206                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    8207              
    8208              $C$DW$687       .dwtag  DW_TAG_member
    8209                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$37)
    8210                      .dwattr $C$DW$687, DW_AT_name("IDRIVEN_LS")
    8211                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_IDRIVEN_LS")
    8212                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8213                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    8214              
    8215              $C$DW$688       .dwtag  DW_TAG_member
    8216                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$39)
    8217                      .dwattr $C$DW$688, DW_AT_name("TDRIVEP")
    8218                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_TDRIVEP")
    8219                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8220                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    8221              
    8222              $C$DW$689       .dwtag  DW_TAG_member
    8223                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$25)
    8224                      .dwattr $C$DW$689, DW_AT_name("CTRL06_RSV1")
    8225                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_CTRL06_RSV1")
    8226                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8227                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8228              
    8229                      .dwendtag $C$DW$T$40
    8230              
    8231              $C$DW$T$87      .dwtag  DW_TAG_typedef
    8232                      .dwattr $C$DW$T$87, DW_AT_name("DRV_SPI_8305_Ctrl06_t_")
    8233                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$40)
    8234                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    8235              
    8236              
    8237              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    8238                      .dwattr $C$DW$T$51, DW_AT_name("_DRV_SPI_8305_Ctrl07_t_")
    8239                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x06)
    8240              $C$DW$690       .dwtag  DW_TAG_member
    8241                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$42)
    8242                      .dwattr $C$DW$690, DW_AT_name("TVDS")
    8243                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_TVDS")
    8244                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8245                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8246              
    8247              $C$DW$691       .dwtag  DW_TAG_member
    8248                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$44)
    8249                      .dwattr $C$DW$691, DW_AT_name("TBLANK")
    8250                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_TBLANK")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  157

    8251                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8252                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8253              
    8254              $C$DW$692       .dwtag  DW_TAG_member
    8255                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$46)
    8256                      .dwattr $C$DW$692, DW_AT_name("DEAD_TIME")
    8257                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_DEAD_TIME")
    8258                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8259                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8260              
    8261              $C$DW$693       .dwtag  DW_TAG_member
    8262                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$48)
    8263                      .dwattr $C$DW$693, DW_AT_name("PWM_MODE")
    8264                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_PWM_MODE")
    8265                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8266                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8267              
    8268              $C$DW$694       .dwtag  DW_TAG_member
    8269                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$50)
    8270                      .dwattr $C$DW$694, DW_AT_name("COMM_OPT")
    8271                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_COMM_OPT")
    8272                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8273                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8274              
    8275              $C$DW$695       .dwtag  DW_TAG_member
    8276                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$25)
    8277                      .dwattr $C$DW$695, DW_AT_name("CTRL07_RSV1")
    8278                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_CTRL07_RSV1")
    8279                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8280                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8281              
    8282                      .dwendtag $C$DW$T$51
    8283              
    8284              $C$DW$T$88      .dwtag  DW_TAG_typedef
    8285                      .dwattr $C$DW$T$88, DW_AT_name("DRV_SPI_8305_Ctrl07_t_")
    8286                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$51)
    8287                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    8288              
    8289              
    8290              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    8291                      .dwattr $C$DW$T$53, DW_AT_name("_DRV_SPI_8305_Ctrl08_t_")
    8292                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    8293              $C$DW$696       .dwtag  DW_TAG_member
    8294                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$52)
    8295                      .dwattr $C$DW$696, DW_AT_name("CTRL08_RSV1")
    8296                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_CTRL08_RSV1")
    8297                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8298                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8299              
    8300                      .dwendtag $C$DW$T$53
    8301              
    8302              $C$DW$T$89      .dwtag  DW_TAG_typedef
    8303                      .dwattr $C$DW$T$89, DW_AT_name("DRV_SPI_8305_Ctrl08_t_")
    8304                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$53)
    8305                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  158

    8306              
    8307              
    8308              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    8309                      .dwattr $C$DW$T$56, DW_AT_name("_DRV_SPI_8305_Ctrl09_t_")
    8310                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x0a)
    8311              $C$DW$697       .dwtag  DW_TAG_member
    8312                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$25)
    8313                      .dwattr $C$DW$697, DW_AT_name("SET_VCPH_UV")
    8314                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_SET_VCPH_UV")
    8315                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8316                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8317              
    8318              $C$DW$698       .dwtag  DW_TAG_member
    8319                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$25)
    8320                      .dwattr $C$DW$698, DW_AT_name("CLR_FLTS")
    8321                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_CLR_FLTS")
    8322                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8323                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8324              
    8325              $C$DW$699       .dwtag  DW_TAG_member
    8326                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$25)
    8327                      .dwattr $C$DW$699, DW_AT_name("SLEEP")
    8328                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_SLEEP")
    8329                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8330                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8331              
    8332              $C$DW$700       .dwtag  DW_TAG_member
    8333                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$25)
    8334                      .dwattr $C$DW$700, DW_AT_name("WD_EN")
    8335                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_WD_EN")
    8336                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8337                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8338              
    8339              $C$DW$701       .dwtag  DW_TAG_member
    8340                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$25)
    8341                      .dwattr $C$DW$701, DW_AT_name("DIS_SNS_OCP")
    8342                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_DIS_SNS_OCP")
    8343                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8344                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8345              
    8346              $C$DW$702       .dwtag  DW_TAG_member
    8347                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$55)
    8348                      .dwattr $C$DW$702, DW_AT_name("WD_DLY")
    8349                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_WD_DLY")
    8350                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8351                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8352              
    8353              $C$DW$703       .dwtag  DW_TAG_member
    8354                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$25)
    8355                      .dwattr $C$DW$703, DW_AT_name("EN_SNS_CLAMP")
    8356                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_EN_SNS_CLAMP")
    8357                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8358                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8359              
    8360              $C$DW$704       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  159

    8361                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$25)
    8362                      .dwattr $C$DW$704, DW_AT_name("DIS_GDRV_FAULT")
    8363                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_DIS_GDRV_FAULT")
    8364                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8365                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8366              
    8367              $C$DW$705       .dwtag  DW_TAG_member
    8368                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$25)
    8369                      .dwattr $C$DW$705, DW_AT_name("DISABLE")
    8370                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_DISABLE")
    8371                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8372                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8373              
    8374              $C$DW$706       .dwtag  DW_TAG_member
    8375                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$25)
    8376                      .dwattr $C$DW$706, DW_AT_name("FLIP_OTS")
    8377                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_FLIP_OTS")
    8378                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8379                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8380              
    8381                      .dwendtag $C$DW$T$56
    8382              
    8383              $C$DW$T$90      .dwtag  DW_TAG_typedef
    8384                      .dwattr $C$DW$T$90, DW_AT_name("DRV_SPI_8305_Ctrl09_t_")
    8385                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$56)
    8386                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    8387              
    8388              
    8389              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    8390                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8305_Ctrl0A_t_")
    8391                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x07)
    8392              $C$DW$707       .dwtag  DW_TAG_member
    8393                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$58)
    8394                      .dwattr $C$DW$707, DW_AT_name("GAIN_CS1")
    8395                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_GAIN_CS1")
    8396                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8397                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8398              
    8399              $C$DW$708       .dwtag  DW_TAG_member
    8400                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$60)
    8401                      .dwattr $C$DW$708, DW_AT_name("GAIN_CS2")
    8402                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_GAIN_CS2")
    8403                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8404                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8405              
    8406              $C$DW$709       .dwtag  DW_TAG_member
    8407                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$62)
    8408                      .dwattr $C$DW$709, DW_AT_name("GAIN_CS3")
    8409                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_GAIN_CS3")
    8410                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8411                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8412              
    8413              $C$DW$710       .dwtag  DW_TAG_member
    8414                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$64)
    8415                      .dwattr $C$DW$710, DW_AT_name("CS_BLANK")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  160

    8416                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_CS_BLANK")
    8417                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8418                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8419              
    8420              $C$DW$711       .dwtag  DW_TAG_member
    8421                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$25)
    8422                      .dwattr $C$DW$711, DW_AT_name("DC_CAL_CH1")
    8423                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_DC_CAL_CH1")
    8424                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8425                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8426              
    8427              $C$DW$712       .dwtag  DW_TAG_member
    8428                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$25)
    8429                      .dwattr $C$DW$712, DW_AT_name("DC_CAL_CH2")
    8430                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_DC_CAL_CH2")
    8431                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8432                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8433              
    8434              $C$DW$713       .dwtag  DW_TAG_member
    8435                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$25)
    8436                      .dwattr $C$DW$713, DW_AT_name("DC_CAL_CH3")
    8437                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_DC_CAL_CH3")
    8438                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8439                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8440              
    8441                      .dwendtag $C$DW$T$65
    8442              
    8443              $C$DW$T$91      .dwtag  DW_TAG_typedef
    8444                      .dwattr $C$DW$T$91, DW_AT_name("DRV_SPI_8305_Ctrl0A_t_")
    8445                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$65)
    8446                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    8447              
    8448              
    8449              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    8450                      .dwattr $C$DW$T$72, DW_AT_name("_DRV_SPI_8305_Ctrl0B_t_")
    8451                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x08)
    8452              $C$DW$714       .dwtag  DW_TAG_member
    8453                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$67)
    8454                      .dwattr $C$DW$714, DW_AT_name("VREG_UV_LEVEL")
    8455                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_VREG_UV_LEVEL")
    8456                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8457                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8458              
    8459              $C$DW$715       .dwtag  DW_TAG_member
    8460                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$25)
    8461                      .dwattr $C$DW$715, DW_AT_name("DIS_PWRGD")
    8462                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_DIS_PWRGD")
    8463                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8464                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8465              
    8466              $C$DW$716       .dwtag  DW_TAG_member
    8467                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$69)
    8468                      .dwattr $C$DW$716, DW_AT_name("SLP_DLY")
    8469                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_SLP_DLY")
    8470                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  161

    8471                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8472              
    8473              $C$DW$717       .dwtag  DW_TAG_member
    8474                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$25)
    8475                      .dwattr $C$DW$717, DW_AT_name("CTRL0B_RSV1")
    8476                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_CTRL0B_RSV1")
    8477                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8478                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8479              
    8480              $C$DW$718       .dwtag  DW_TAG_member
    8481                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$25)
    8482                      .dwattr $C$DW$718, DW_AT_name("CTRL0B_RSV2")
    8483                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_CTRL0B_RSV2")
    8484                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8485                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8486              
    8487              $C$DW$719       .dwtag  DW_TAG_member
    8488                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$25)
    8489                      .dwattr $C$DW$719, DW_AT_name("CTRL0B_RSV3")
    8490                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_CTRL0B_RSV3")
    8491                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8492                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8493              
    8494              $C$DW$720       .dwtag  DW_TAG_member
    8495                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$71)
    8496                      .dwattr $C$DW$720, DW_AT_name("VREF_SCALING")
    8497                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_VREF_SCALING")
    8498                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8499                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8500              
    8501              $C$DW$721       .dwtag  DW_TAG_member
    8502                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$25)
    8503                      .dwattr $C$DW$721, DW_AT_name("CTRL0B_RSV4")
    8504                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_CTRL0B_RSV4")
    8505                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8506                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8507              
    8508                      .dwendtag $C$DW$T$72
    8509              
    8510              $C$DW$T$92      .dwtag  DW_TAG_typedef
    8511                      .dwattr $C$DW$T$92, DW_AT_name("DRV_SPI_8305_Ctrl0B_t_")
    8512                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$72)
    8513                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    8514              
    8515              
    8516              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    8517                      .dwattr $C$DW$T$77, DW_AT_name("_DRV_SPI_8305_Ctrl0C_t_")
    8518                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x05)
    8519              $C$DW$722       .dwtag  DW_TAG_member
    8520                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$74)
    8521                      .dwattr $C$DW$722, DW_AT_name("VDS_MODE")
    8522                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_VDS_MODE")
    8523                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8524                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8525              
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  162

    8526              $C$DW$723       .dwtag  DW_TAG_member
    8527                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$76)
    8528                      .dwattr $C$DW$723, DW_AT_name("VDS_LEVEL")
    8529                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_VDS_LEVEL")
    8530                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8531                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8532              
    8533              $C$DW$724       .dwtag  DW_TAG_member
    8534                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$25)
    8535                      .dwattr $C$DW$724, DW_AT_name("CTRL0C_RSV1")
    8536                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_CTRL0C_RSV1")
    8537                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8538                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8539              
    8540              $C$DW$725       .dwtag  DW_TAG_member
    8541                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$25)
    8542                      .dwattr $C$DW$725, DW_AT_name("CTRL0C_RSV2")
    8543                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_CTRL0C_RSV2")
    8544                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8545                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8546              
    8547              $C$DW$726       .dwtag  DW_TAG_member
    8548                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$25)
    8549                      .dwattr $C$DW$726, DW_AT_name("CTRL0C_RSV3")
    8550                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_CTRL0C_RSV3")
    8551                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8552                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8553              
    8554                      .dwendtag $C$DW$T$77
    8555              
    8556              $C$DW$T$93      .dwtag  DW_TAG_typedef
    8557                      .dwattr $C$DW$T$93, DW_AT_name("DRV_SPI_8305_Ctrl0C_t_")
    8558                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$77)
    8559                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    8560              
    8561              
    8562              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    8563                      .dwattr $C$DW$T$78, DW_AT_name("_DRV_SPI_8305_Stat01_t_")
    8564                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0b)
    8565              $C$DW$727       .dwtag  DW_TAG_member
    8566                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$25)
    8567                      .dwattr $C$DW$727, DW_AT_name("OTW")
    8568                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_OTW")
    8569                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8570                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8571              
    8572              $C$DW$728       .dwtag  DW_TAG_member
    8573                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$25)
    8574                      .dwattr $C$DW$728, DW_AT_name("TEMP_FLAG3")
    8575                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_TEMP_FLAG3")
    8576                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8577                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8578              
    8579              $C$DW$729       .dwtag  DW_TAG_member
    8580                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  163

    8581                      .dwattr $C$DW$729, DW_AT_name("TEMP_FLAG2")
    8582                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_TEMP_FLAG2")
    8583                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8584                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8585              
    8586              $C$DW$730       .dwtag  DW_TAG_member
    8587                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$25)
    8588                      .dwattr $C$DW$730, DW_AT_name("TEMP_FLAG1")
    8589                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_TEMP_FLAG1")
    8590                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8591                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8592              
    8593              $C$DW$731       .dwtag  DW_TAG_member
    8594                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$25)
    8595                      .dwattr $C$DW$731, DW_AT_name("VCPH_UVFL")
    8596                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_VCPH_UVFL")
    8597                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8598                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8599              
    8600              $C$DW$732       .dwtag  DW_TAG_member
    8601                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$25)
    8602                      .dwattr $C$DW$732, DW_AT_name("VDS_STATUS")
    8603                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_VDS_STATUS")
    8604                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8605                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8606              
    8607              $C$DW$733       .dwtag  DW_TAG_member
    8608                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$25)
    8609                      .dwattr $C$DW$733, DW_AT_name("PVDD_OVFL")
    8610                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_PVDD_OVFL")
    8611                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8612                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8613              
    8614              $C$DW$734       .dwtag  DW_TAG_member
    8615                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$25)
    8616                      .dwattr $C$DW$734, DW_AT_name("PVDD_UVFL")
    8617                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_PVDD_UVFL")
    8618                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8619                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8620              
    8621              $C$DW$735       .dwtag  DW_TAG_member
    8622                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$25)
    8623                      .dwattr $C$DW$735, DW_AT_name("TEMP_FLAG4")
    8624                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_TEMP_FLAG4")
    8625                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8626                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8627              
    8628              $C$DW$736       .dwtag  DW_TAG_member
    8629                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$25)
    8630                      .dwattr $C$DW$736, DW_AT_name("STAT01_RSV1")
    8631                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_STAT01_RSV1")
    8632                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8633                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8634              
    8635              $C$DW$737       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  164

    8636                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$25)
    8637                      .dwattr $C$DW$737, DW_AT_name("FAULT")
    8638                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_FAULT")
    8639                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8640                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8641              
    8642                      .dwendtag $C$DW$T$78
    8643              
    8644              $C$DW$T$82      .dwtag  DW_TAG_typedef
    8645                      .dwattr $C$DW$T$82, DW_AT_name("DRV_SPI_8305_Stat01_t_")
    8646                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$78)
    8647                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    8648              
    8649              
    8650              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    8651                      .dwattr $C$DW$T$79, DW_AT_name("_DRV_SPI_8305_Stat02_t_")
    8652                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x0b)
    8653              $C$DW$738       .dwtag  DW_TAG_member
    8654                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$25)
    8655                      .dwattr $C$DW$738, DW_AT_name("SNS_A_OCP")
    8656                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_SNS_A_OCP")
    8657                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8658                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8659              
    8660              $C$DW$739       .dwtag  DW_TAG_member
    8661                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$25)
    8662                      .dwattr $C$DW$739, DW_AT_name("SNS_B_OCP")
    8663                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_SNS_B_OCP")
    8664                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8665                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8666              
    8667              $C$DW$740       .dwtag  DW_TAG_member
    8668                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$25)
    8669                      .dwattr $C$DW$740, DW_AT_name("SNS_C_OCP")
    8670                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_SNS_C_OCP")
    8671                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8672                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8673              
    8674              $C$DW$741       .dwtag  DW_TAG_member
    8675                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$25)
    8676                      .dwattr $C$DW$741, DW_AT_name("STAT02_RSV2")
    8677                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_STAT02_RSV2")
    8678                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8679                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8680              
    8681              $C$DW$742       .dwtag  DW_TAG_member
    8682                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$25)
    8683                      .dwattr $C$DW$742, DW_AT_name("STAT02_RSV1")
    8684                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_STAT02_RSV1")
    8685                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8686                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8687              
    8688              $C$DW$743       .dwtag  DW_TAG_member
    8689                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$25)
    8690                      .dwattr $C$DW$743, DW_AT_name("FETLC_VDS")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  165

    8691                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_FETLC_VDS")
    8692                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8693                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8694              
    8695              $C$DW$744       .dwtag  DW_TAG_member
    8696                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$25)
    8697                      .dwattr $C$DW$744, DW_AT_name("FETHC_VDS")
    8698                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_FETHC_VDS")
    8699                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8700                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8701              
    8702              $C$DW$745       .dwtag  DW_TAG_member
    8703                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$25)
    8704                      .dwattr $C$DW$745, DW_AT_name("FETLB_VDS")
    8705                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_FETLB_VDS")
    8706                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8707                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8708              
    8709              $C$DW$746       .dwtag  DW_TAG_member
    8710                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$25)
    8711                      .dwattr $C$DW$746, DW_AT_name("FETHB_VDS")
    8712                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_FETHB_VDS")
    8713                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8714                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8715              
    8716              $C$DW$747       .dwtag  DW_TAG_member
    8717                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$25)
    8718                      .dwattr $C$DW$747, DW_AT_name("FETLA_VDS")
    8719                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_FETLA_VDS")
    8720                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8721                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8722              
    8723              $C$DW$748       .dwtag  DW_TAG_member
    8724                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$25)
    8725                      .dwattr $C$DW$748, DW_AT_name("FETHA_VDS")
    8726                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_FETHA_VDS")
    8727                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8728                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8729              
    8730                      .dwendtag $C$DW$T$79
    8731              
    8732              $C$DW$T$83      .dwtag  DW_TAG_typedef
    8733                      .dwattr $C$DW$T$83, DW_AT_name("DRV_SPI_8305_Stat02_t_")
    8734                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$79)
    8735                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    8736              
    8737              
    8738              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    8739                      .dwattr $C$DW$T$80, DW_AT_name("_DRV_SPI_8305_Stat03_t_")
    8740                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x0b)
    8741              $C$DW$749       .dwtag  DW_TAG_member
    8742                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$25)
    8743                      .dwattr $C$DW$749, DW_AT_name("VCPH_OVLO_ABS")
    8744                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_VCPH_OVLO_ABS")
    8745                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  166

    8746                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8747              
    8748              $C$DW$750       .dwtag  DW_TAG_member
    8749                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$25)
    8750                      .dwattr $C$DW$750, DW_AT_name("VCPH_OVLO")
    8751                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_VCPH_OVLO")
    8752                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8753                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8754              
    8755              $C$DW$751       .dwtag  DW_TAG_member
    8756                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$25)
    8757                      .dwattr $C$DW$751, DW_AT_name("VCPH_UVLO2")
    8758                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_VCPH_UVLO2")
    8759                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8760                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8761              
    8762              $C$DW$752       .dwtag  DW_TAG_member
    8763                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$25)
    8764                      .dwattr $C$DW$752, DW_AT_name("STAT03_RSV2")
    8765                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_STAT03_RSV2")
    8766                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8767                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8768              
    8769              $C$DW$753       .dwtag  DW_TAG_member
    8770                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$25)
    8771                      .dwattr $C$DW$753, DW_AT_name("VCP_LSD_UVLO2")
    8772                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_VCP_LSD_UVLO2")
    8773                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8774                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8775              
    8776              $C$DW$754       .dwtag  DW_TAG_member
    8777                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$25)
    8778                      .dwattr $C$DW$754, DW_AT_name("AVDD_UVLO")
    8779                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_AVDD_UVLO")
    8780                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8781                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8782              
    8783              $C$DW$755       .dwtag  DW_TAG_member
    8784                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$25)
    8785                      .dwattr $C$DW$755, DW_AT_name("VREG_UV")
    8786                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_VREG_UV")
    8787                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8788                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8789              
    8790              $C$DW$756       .dwtag  DW_TAG_member
    8791                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$25)
    8792                      .dwattr $C$DW$756, DW_AT_name("STAT03_RSV1")
    8793                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_STAT03_RSV1")
    8794                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8795                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8796              
    8797              $C$DW$757       .dwtag  DW_TAG_member
    8798                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$25)
    8799                      .dwattr $C$DW$757, DW_AT_name("OTS")
    8800                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_OTS")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  167

    8801                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8802                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8803              
    8804              $C$DW$758       .dwtag  DW_TAG_member
    8805                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$25)
    8806                      .dwattr $C$DW$758, DW_AT_name("WD_FAULT")
    8807                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_WD_FAULT")
    8808                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8809                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8810              
    8811              $C$DW$759       .dwtag  DW_TAG_member
    8812                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$25)
    8813                      .dwattr $C$DW$759, DW_AT_name("PVDD_UVLO2")
    8814                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_PVDD_UVLO2")
    8815                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8816                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8817              
    8818                      .dwendtag $C$DW$T$80
    8819              
    8820              $C$DW$T$84      .dwtag  DW_TAG_typedef
    8821                      .dwattr $C$DW$T$84, DW_AT_name("DRV_SPI_8305_Stat03_t_")
    8822                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$80)
    8823                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    8824              
    8825              
    8826              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    8827                      .dwattr $C$DW$T$81, DW_AT_name("_DRV_SPI_8305_Stat04_t_")
    8828                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0b)
    8829              $C$DW$760       .dwtag  DW_TAG_member
    8830                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$25)
    8831                      .dwattr $C$DW$760, DW_AT_name("STAT04_RSV5")
    8832                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_STAT04_RSV5")
    8833                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8834                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8835              
    8836              $C$DW$761       .dwtag  DW_TAG_member
    8837                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$25)
    8838                      .dwattr $C$DW$761, DW_AT_name("STAT04_RSV4")
    8839                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_STAT04_RSV4")
    8840                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8841                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8842              
    8843              $C$DW$762       .dwtag  DW_TAG_member
    8844                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$25)
    8845                      .dwattr $C$DW$762, DW_AT_name("STAT04_RSV3")
    8846                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_STAT04_RSV3")
    8847                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8848                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8849              
    8850              $C$DW$763       .dwtag  DW_TAG_member
    8851                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$25)
    8852                      .dwattr $C$DW$763, DW_AT_name("STAT04_RSV2")
    8853                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_STAT04_RSV2")
    8854                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8855                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  168

    8856              
    8857              $C$DW$764       .dwtag  DW_TAG_member
    8858                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$25)
    8859                      .dwattr $C$DW$764, DW_AT_name("STAT04_RSV1")
    8860                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_STAT04_RSV1")
    8861                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8862                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8863              
    8864              $C$DW$765       .dwtag  DW_TAG_member
    8865                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$25)
    8866                      .dwattr $C$DW$765, DW_AT_name("FETLC_VGS")
    8867                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_FETLC_VGS")
    8868                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8869                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8870              
    8871              $C$DW$766       .dwtag  DW_TAG_member
    8872                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$25)
    8873                      .dwattr $C$DW$766, DW_AT_name("FETHC_VGS")
    8874                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_FETHC_VGS")
    8875                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8876                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8877              
    8878              $C$DW$767       .dwtag  DW_TAG_member
    8879                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$25)
    8880                      .dwattr $C$DW$767, DW_AT_name("FETLB_VGS")
    8881                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_FETLB_VGS")
    8882                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8883                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8884              
    8885              $C$DW$768       .dwtag  DW_TAG_member
    8886                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$25)
    8887                      .dwattr $C$DW$768, DW_AT_name("FETHB_VGS")
    8888                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_FETHB_VGS")
    8889                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8890                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8891              
    8892              $C$DW$769       .dwtag  DW_TAG_member
    8893                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$25)
    8894                      .dwattr $C$DW$769, DW_AT_name("FETLA_VGS")
    8895                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_FETLA_VGS")
    8896                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8897                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8898              
    8899              $C$DW$770       .dwtag  DW_TAG_member
    8900                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$25)
    8901                      .dwattr $C$DW$770, DW_AT_name("FETHA_VGS")
    8902                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_FETHA_VGS")
    8903                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8904                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8905              
    8906                      .dwendtag $C$DW$T$81
    8907              
    8908              $C$DW$T$85      .dwtag  DW_TAG_typedef
    8909                      .dwattr $C$DW$T$85, DW_AT_name("DRV_SPI_8305_Stat04_t_")
    8910                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$81)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  169

    8911                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    8912              
    8913              
    8914              $C$DW$T$94      .dwtag  DW_TAG_structure_type
    8915                      .dwattr $C$DW$T$94, DW_AT_name("_DRV_SPI_8305_Vars_t_")
    8916                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x61)
    8917              $C$DW$771       .dwtag  DW_TAG_member
    8918                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$82)
    8919                      .dwattr $C$DW$771, DW_AT_name("Stat_Reg_01")
    8920                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Stat_Reg_01")
    8921                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8922                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8923              
    8924              $C$DW$772       .dwtag  DW_TAG_member
    8925                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$83)
    8926                      .dwattr $C$DW$772, DW_AT_name("Stat_Reg_02")
    8927                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Stat_Reg_02")
    8928                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8929                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8930              
    8931              $C$DW$773       .dwtag  DW_TAG_member
    8932                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$84)
    8933                      .dwattr $C$DW$773, DW_AT_name("Stat_Reg_03")
    8934                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Stat_Reg_03")
    8935                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8936                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8937              
    8938              $C$DW$774       .dwtag  DW_TAG_member
    8939                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$85)
    8940                      .dwattr $C$DW$774, DW_AT_name("Stat_Reg_04")
    8941                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Stat_Reg_04")
    8942                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    8943                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8944              
    8945              $C$DW$775       .dwtag  DW_TAG_member
    8946                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$86)
    8947                      .dwattr $C$DW$775, DW_AT_name("Ctrl_Reg_05")
    8948                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_Ctrl_Reg_05")
    8949                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8950                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8951              
    8952              $C$DW$776       .dwtag  DW_TAG_member
    8953                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$87)
    8954                      .dwattr $C$DW$776, DW_AT_name("Ctrl_Reg_06")
    8955                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Ctrl_Reg_06")
    8956                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    8957                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8958              
    8959              $C$DW$777       .dwtag  DW_TAG_member
    8960                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$88)
    8961                      .dwattr $C$DW$777, DW_AT_name("Ctrl_Reg_07")
    8962                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Ctrl_Reg_07")
    8963                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8964                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8965              
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  170

    8966              $C$DW$778       .dwtag  DW_TAG_member
    8967                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$89)
    8968                      .dwattr $C$DW$778, DW_AT_name("Ctrl_Reg_08")
    8969                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Ctrl_Reg_08")
    8970                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    8971                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8972              
    8973              $C$DW$779       .dwtag  DW_TAG_member
    8974                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$90)
    8975                      .dwattr $C$DW$779, DW_AT_name("Ctrl_Reg_09")
    8976                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Ctrl_Reg_09")
    8977                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    8978                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8979              
    8980              $C$DW$780       .dwtag  DW_TAG_member
    8981                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$91)
    8982                      .dwattr $C$DW$780, DW_AT_name("Ctrl_Reg_0A")
    8983                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Ctrl_Reg_0A")
    8984                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    8985                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8986              
    8987              $C$DW$781       .dwtag  DW_TAG_member
    8988                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$92)
    8989                      .dwattr $C$DW$781, DW_AT_name("Ctrl_Reg_0B")
    8990                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Ctrl_Reg_0B")
    8991                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    8992                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8993              
    8994              $C$DW$782       .dwtag  DW_TAG_member
    8995                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$93)
    8996                      .dwattr $C$DW$782, DW_AT_name("Ctrl_Reg_0C")
    8997                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Ctrl_Reg_0C")
    8998                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    8999                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    9000              
    9001              $C$DW$783       .dwtag  DW_TAG_member
    9002                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$25)
    9003                      .dwattr $C$DW$783, DW_AT_name("WriteCmd")
    9004                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_WriteCmd")
    9005                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    9006                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    9007              
    9008              $C$DW$784       .dwtag  DW_TAG_member
    9009                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$25)
    9010                      .dwattr $C$DW$784, DW_AT_name("ReadCmd")
    9011                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_ReadCmd")
    9012                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    9013                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    9014              
    9015              $C$DW$785       .dwtag  DW_TAG_member
    9016                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$52)
    9017                      .dwattr $C$DW$785, DW_AT_name("ManWriteAddr")
    9018                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_ManWriteAddr")
    9019                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x5b]
    9020                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  171

    9021              
    9022              $C$DW$786       .dwtag  DW_TAG_member
    9023                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$52)
    9024                      .dwattr $C$DW$786, DW_AT_name("ManReadAddr")
    9025                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_ManReadAddr")
    9026                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9027                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    9028              
    9029              $C$DW$787       .dwtag  DW_TAG_member
    9030                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$52)
    9031                      .dwattr $C$DW$787, DW_AT_name("ManWriteData")
    9032                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_ManWriteData")
    9033                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    9034                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    9035              
    9036              $C$DW$788       .dwtag  DW_TAG_member
    9037                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$52)
    9038                      .dwattr $C$DW$788, DW_AT_name("ManReadData")
    9039                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_ManReadData")
    9040                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9041                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    9042              
    9043              $C$DW$789       .dwtag  DW_TAG_member
    9044                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$25)
    9045                      .dwattr $C$DW$789, DW_AT_name("ManWriteCmd")
    9046                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_ManWriteCmd")
    9047                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
    9048                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    9049              
    9050              $C$DW$790       .dwtag  DW_TAG_member
    9051                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$25)
    9052                      .dwattr $C$DW$790, DW_AT_name("ManReadCmd")
    9053                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_ManReadCmd")
    9054                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9055                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    9056              
    9057                      .dwendtag $C$DW$T$94
    9058              
    9059              $C$DW$T$199     .dwtag  DW_TAG_typedef
    9060                      .dwattr $C$DW$T$199, DW_AT_name("DRV_SPI_8305_Vars_t")
    9061                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$94)
    9062                      .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    9063              
    9064              $C$DW$T$200     .dwtag  DW_TAG_pointer_type
    9065                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
    9066                      .dwattr $C$DW$T$200, DW_AT_address_class(0x20)
    9067              
    9068              $C$DW$791       .dwtag  DW_TAG_TI_far_type
    9069                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$200)
    9070              
    9071              $C$DW$T$201     .dwtag  DW_TAG_const_type
    9072                      .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$791)
    9073              
    9074              
    9075              $C$DW$T$104     .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  172

    9076                      .dwattr $C$DW$T$104, DW_AT_name("_GPIO_Obj_")
    9077                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x6a)
    9078              $C$DW$792       .dwtag  DW_TAG_member
    9079                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$96)
    9080                      .dwattr $C$DW$792, DW_AT_name("GPACTRL")
    9081                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_GPACTRL")
    9082                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9083                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    9084              
    9085              $C$DW$793       .dwtag  DW_TAG_member
    9086                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$96)
    9087                      .dwattr $C$DW$793, DW_AT_name("GPAQSEL1")
    9088                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_GPAQSEL1")
    9089                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9090                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    9091              
    9092              $C$DW$794       .dwtag  DW_TAG_member
    9093                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$96)
    9094                      .dwattr $C$DW$794, DW_AT_name("GPAQSEL2")
    9095                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_GPAQSEL2")
    9096                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9097                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    9098              
    9099              $C$DW$795       .dwtag  DW_TAG_member
    9100                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$96)
    9101                      .dwattr $C$DW$795, DW_AT_name("GPAMUX1")
    9102                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_GPAMUX1")
    9103                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9104                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    9105              
    9106              $C$DW$796       .dwtag  DW_TAG_member
    9107                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$96)
    9108                      .dwattr $C$DW$796, DW_AT_name("GPAMUX2")
    9109                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_GPAMUX2")
    9110                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9111                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    9112              
    9113              $C$DW$797       .dwtag  DW_TAG_member
    9114                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$96)
    9115                      .dwattr $C$DW$797, DW_AT_name("GPADIR")
    9116                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_GPADIR")
    9117                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9118                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    9119              
    9120              $C$DW$798       .dwtag  DW_TAG_member
    9121                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$96)
    9122                      .dwattr $C$DW$798, DW_AT_name("GPAPUD")
    9123                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_GPAPUD")
    9124                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9125                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    9126              
    9127              $C$DW$799       .dwtag  DW_TAG_member
    9128                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$98)
    9129                      .dwattr $C$DW$799, DW_AT_name("rsvd_1")
    9130                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_rsvd_1")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  173

    9131                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9132                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    9133              
    9134              $C$DW$800       .dwtag  DW_TAG_member
    9135                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$96)
    9136                      .dwattr $C$DW$800, DW_AT_name("GPBCTRL")
    9137                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_GPBCTRL")
    9138                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9139                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    9140              
    9141              $C$DW$801       .dwtag  DW_TAG_member
    9142                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$96)
    9143                      .dwattr $C$DW$801, DW_AT_name("GPBQSEL1")
    9144                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_GPBQSEL1")
    9145                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9146                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    9147              
    9148              $C$DW$802       .dwtag  DW_TAG_member
    9149                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$98)
    9150                      .dwattr $C$DW$802, DW_AT_name("rsvd_2")
    9151                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_rsvd_2")
    9152                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9153                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    9154              
    9155              $C$DW$803       .dwtag  DW_TAG_member
    9156                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$96)
    9157                      .dwattr $C$DW$803, DW_AT_name("GPBMUX1")
    9158                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_GPBMUX1")
    9159                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9160                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    9161              
    9162              $C$DW$804       .dwtag  DW_TAG_member
    9163                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$98)
    9164                      .dwattr $C$DW$804, DW_AT_name("rsvd_3")
    9165                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_rsvd_3")
    9166                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9167                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    9168              
    9169              $C$DW$805       .dwtag  DW_TAG_member
    9170                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$96)
    9171                      .dwattr $C$DW$805, DW_AT_name("GPBDIR")
    9172                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_GPBDIR")
    9173                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9174                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    9175              
    9176              $C$DW$806       .dwtag  DW_TAG_member
    9177                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$96)
    9178                      .dwattr $C$DW$806, DW_AT_name("GPBPUD")
    9179                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_GPBPUD")
    9180                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9181                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    9182              
    9183              $C$DW$807       .dwtag  DW_TAG_member
    9184                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$99)
    9185                      .dwattr $C$DW$807, DW_AT_name("rsvd_4")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  174

    9186                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_rsvd_4")
    9187                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9188                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    9189              
    9190              $C$DW$808       .dwtag  DW_TAG_member
    9191                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$96)
    9192                      .dwattr $C$DW$808, DW_AT_name("AIOMUX1")
    9193                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_AIOMUX1")
    9194                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9195                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    9196              
    9197              $C$DW$809       .dwtag  DW_TAG_member
    9198                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$98)
    9199                      .dwattr $C$DW$809, DW_AT_name("rsvd_5")
    9200                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_rsvd_5")
    9201                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9202                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    9203              
    9204              $C$DW$810       .dwtag  DW_TAG_member
    9205                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$96)
    9206                      .dwattr $C$DW$810, DW_AT_name("AIODIR")
    9207                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_AIODIR")
    9208                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    9209                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    9210              
    9211              $C$DW$811       .dwtag  DW_TAG_member
    9212                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$100)
    9213                      .dwattr $C$DW$811, DW_AT_name("rsvd_6")
    9214                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_rsvd_6")
    9215                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9216                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    9217              
    9218              $C$DW$812       .dwtag  DW_TAG_member
    9219                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$96)
    9220                      .dwattr $C$DW$812, DW_AT_name("GPADAT")
    9221                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_GPADAT")
    9222                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9223                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    9224              
    9225              $C$DW$813       .dwtag  DW_TAG_member
    9226                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$96)
    9227                      .dwattr $C$DW$813, DW_AT_name("GPASET")
    9228                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_GPASET")
    9229                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    9230                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    9231              
    9232              $C$DW$814       .dwtag  DW_TAG_member
    9233                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$96)
    9234                      .dwattr $C$DW$814, DW_AT_name("GPACLEAR")
    9235                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_GPACLEAR")
    9236                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9237                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    9238              
    9239              $C$DW$815       .dwtag  DW_TAG_member
    9240                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$96)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  175

    9241                      .dwattr $C$DW$815, DW_AT_name("GPATOGGLE")
    9242                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_GPATOGGLE")
    9243                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9244                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    9245              
    9246              $C$DW$816       .dwtag  DW_TAG_member
    9247                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$96)
    9248                      .dwattr $C$DW$816, DW_AT_name("GPBDAT")
    9249                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_GPBDAT")
    9250                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    9251                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    9252              
    9253              $C$DW$817       .dwtag  DW_TAG_member
    9254                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$96)
    9255                      .dwattr $C$DW$817, DW_AT_name("GPBSET")
    9256                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_GPBSET")
    9257                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    9258                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    9259              
    9260              $C$DW$818       .dwtag  DW_TAG_member
    9261                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$96)
    9262                      .dwattr $C$DW$818, DW_AT_name("GPBCLEAR")
    9263                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_GPBCLEAR")
    9264                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    9265                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    9266              
    9267              $C$DW$819       .dwtag  DW_TAG_member
    9268                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$96)
    9269                      .dwattr $C$DW$819, DW_AT_name("GPBTOGGLE")
    9270                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_GPBTOGGLE")
    9271                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    9272                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9273              
    9274              $C$DW$820       .dwtag  DW_TAG_member
    9275                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$101)
    9276                      .dwattr $C$DW$820, DW_AT_name("rsvd_7")
    9277                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_rsvd_7")
    9278                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    9279                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    9280              
    9281              $C$DW$821       .dwtag  DW_TAG_member
    9282                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$96)
    9283                      .dwattr $C$DW$821, DW_AT_name("AIODAT")
    9284                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_AIODAT")
    9285                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9286                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    9287              
    9288              $C$DW$822       .dwtag  DW_TAG_member
    9289                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$96)
    9290                      .dwattr $C$DW$822, DW_AT_name("AIOSET")
    9291                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_AIOSET")
    9292                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    9293                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    9294              
    9295              $C$DW$823       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  176

    9296                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$96)
    9297                      .dwattr $C$DW$823, DW_AT_name("AIOCLEAR")
    9298                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_AIOCLEAR")
    9299                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9300                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    9301              
    9302              $C$DW$824       .dwtag  DW_TAG_member
    9303                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$96)
    9304                      .dwattr $C$DW$824, DW_AT_name("AIOTOGGLE")
    9305                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_AIOTOGGLE")
    9306                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9307                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    9308              
    9309              $C$DW$825       .dwtag  DW_TAG_member
    9310                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$102)
    9311                      .dwattr $C$DW$825, DW_AT_name("GPIOXINTnSEL")
    9312                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    9313                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9314                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    9315              
    9316              $C$DW$826       .dwtag  DW_TAG_member
    9317                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$103)
    9318                      .dwattr $C$DW$826, DW_AT_name("rsvd_8")
    9319                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_rsvd_8")
    9320                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    9321                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    9322              
    9323              $C$DW$827       .dwtag  DW_TAG_member
    9324                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$96)
    9325                      .dwattr $C$DW$827, DW_AT_name("GPIOLPMSEL")
    9326                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    9327                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    9328                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    9329              
    9330                      .dwendtag $C$DW$T$104
    9331              
    9332              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    9333                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$104)
    9334                      .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    9335              
    9336              $C$DW$T$22      .dwtag  DW_TAG_typedef
    9337                      .dwattr $C$DW$T$22, DW_AT_name("GPIO_Handle")
    9338                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    9339                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    9340              
    9341              $C$DW$828       .dwtag  DW_TAG_TI_far_type
    9342                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$22)
    9343              
    9344              $C$DW$T$204     .dwtag  DW_TAG_const_type
    9345                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$828)
    9346              
    9347              
    9348              $C$DW$T$105     .dwtag  DW_TAG_structure_type
    9349                      .dwattr $C$DW$T$105, DW_AT_name("_SPI_Obj_")
    9350                      .dwattr $C$DW$T$105, DW_AT_byte_size(0x10)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0485210                         PAGE  177

    9351              $C$DW$829       .dwtag  DW_TAG_member
    9352                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$97)
    9353                      .dwattr $C$DW$829, DW_AT_name("SPICCR")
    9354                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_SPICCR")
