TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0501610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.1.LTS *
       3              ;* Date/Time created: Wed Jan 04 15:50:40 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/drivers/gpio/src/32b/f28x/f2802
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.1.LTS Copyright (c) 1996-2015
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              ;       C:\ti\ccsv7\tools\compiler\ti-cgt-c2000_16.9.1.LTS\bin\opt2000.exe C:\\Users\\ROSSYE~1\\AppData\\Loca

    2184              $C$DW$235       .dwtag  DW_TAG_enumerator
    2185                      .dwattr $C$DW$235, DW_AT_name("GPIO_36_Mode_Rsvd_2")
    2186                      .dwattr $C$DW$235, DW_AT_const_value(0x02)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0501610                         PAGE   41

    2187              
    2188              $C$DW$236       .dwtag  DW_TAG_enumerator
    2189                      .dwattr $C$DW$236, DW_AT_name("GPIO_36_Mode_Rsvd_3")
    2190                      .dwattr $C$DW$236, DW_AT_const_value(0x03)
    2191              
    2192              $C$DW$237       .dwtag  DW_TAG_enumerator
    2193                      .dwattr $C$DW$237, DW_AT_name("GPIO_37_Mode_JTAG_TDO")
    2194                      .dwattr $C$DW$237, DW_AT_const_value(0x00)
    2195              
    2196              $C$DW$238       .dwtag  DW_TAG_enumerator
    2197                      .dwattr $C$DW$238, DW_AT_name("GPIO_37_Mode_Rsvd_1")
    2198                      .dwattr $C$DW$238, DW_AT_const_value(0x01)
    2199              
    2200              $C$DW$239       .dwtag  DW_TAG_enumerator
    2201                      .dwattr $C$DW$239, DW_AT_name("GPIO_37_Mode_Rsvd_2")
    2202                      .dwattr $C$DW$239, DW_AT_const_value(0x02)
    2203              
    2204              $C$DW$240       .dwtag  DW_TAG_enumerator
    2205                      .dwattr $C$DW$240, DW_AT_name("GPIO_37_Mode_Rsvd_3")
    2206                      .dwattr $C$DW$240, DW_AT_const_value(0x03)
    2207              
    2208              $C$DW$241       .dwtag  DW_TAG_enumerator
    2209                      .dwattr $C$DW$241, DW_AT_name("GPIO_38_Mode_JTAG_TCK")
    2210                      .dwattr $C$DW$241, DW_AT_const_value(0x00)
    2211              
    2212              $C$DW$242       .dwtag  DW_TAG_enumerator
    2213                      .dwattr $C$DW$242, DW_AT_name("GPIO_38_Mode_Rsvd_1")
    2214                      .dwattr $C$DW$242, DW_AT_const_value(0x01)
    2215              
    2216              $C$DW$243       .dwtag  DW_TAG_enumerator
    2217                      .dwattr $C$DW$243, DW_AT_name("GPIO_38_Mode_Rsvd_2")
    2218                      .dwattr $C$DW$243, DW_AT_const_value(0x02)
    2219              
    2220              $C$DW$244       .dwtag  DW_TAG_enumerator
    2221                      .dwattr $C$DW$244, DW_AT_name("GPIO_38_Mode_Rsvd_3")
    2222                      .dwattr $C$DW$244, DW_AT_const_value(0x03)
    2223              
    2224                      .dwendtag $C$DW$T$45
    2225              
    2226              $C$DW$T$46      .dwtag  DW_TAG_typedef
    2227                      .dwattr $C$DW$T$46, DW_AT_name("GPIO_Mode_e")
    2228                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2229                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2230              
    2231              $C$DW$245       .dwtag  DW_TAG_TI_far_type
    2232                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$46)
    2233              
    2234              $C$DW$T$47      .dwtag  DW_TAG_const_type
    2235                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$245)
    2236              
    2237              
    2238              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    2239                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2240              $C$DW$246       .dwtag  DW_TAG_enumerator
    2241                      .dwattr $C$DW$246, DW_AT_name("GPIO_Qual_Sync")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0501610                         PAGE   42

    2242                      .dwattr $C$DW$246, DW_AT_const_value(0x00)
    2243              
    2244              $C$DW$247       .dwtag  DW_TAG_enumerator
    2245                      .dwattr $C$DW$247, DW_AT_name("GPIO_Qual_Sample_3")
    2246                      .dwattr $C$DW$247, DW_AT_const_value(0x01)
    2247              
    2248              $C$DW$248       .dwtag  DW_TAG_enumerator
    2249                      .dwattr $C$DW$248, DW_AT_name("GPIO_Qual_Sample_6")
    2250                      .dwattr $C$DW$248, DW_AT_const_value(0x02)
    2251              
    2252              $C$DW$249       .dwtag  DW_TAG_enumerator
    2253                      .dwattr $C$DW$249, DW_AT_name("GPIO_Qual_ASync")
    2254                      .dwattr $C$DW$249, DW_AT_const_value(0x03)
    2255              
    2256                      .dwendtag $C$DW$T$48
    2257              
    2258              $C$DW$T$49      .dwtag  DW_TAG_typedef
    2259                      .dwattr $C$DW$T$49, DW_AT_name("GPIO_Qual_e")
    2260                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2261                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2262              
    2263              $C$DW$250       .dwtag  DW_TAG_TI_far_type
    2264                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$49)
    2265              
    2266              $C$DW$T$50      .dwtag  DW_TAG_const_type
    2267                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$250)
    2268              
    2269              
    2270              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2271                      .dwattr $C$DW$T$29, DW_AT_name("_GPIO_Obj_")
    2272                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6a)
    2273              $C$DW$251       .dwtag  DW_TAG_member
    2274                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2275                      .dwattr $C$DW$251, DW_AT_name("GPACTRL")
    2276                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_GPACTRL")
    2277                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2279              
    2280              $C$DW$252       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    2282                      .dwattr $C$DW$252, DW_AT_name("GPAQSEL1")
    2283                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_GPAQSEL1")
    2284                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2285                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2286              
    2287              $C$DW$253       .dwtag  DW_TAG_member
    2288                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    2289                      .dwattr $C$DW$253, DW_AT_name("GPAQSEL2")
    2290                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_GPAQSEL2")
    2291                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2292                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2293              
    2294              $C$DW$254       .dwtag  DW_TAG_member
    2295                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2296                      .dwattr $C$DW$254, DW_AT_name("GPAMUX1")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0501610                         PAGE   43

    2297                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_GPAMUX1")
    2298                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2299                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2300              
    2301              $C$DW$255       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2303                      .dwattr $C$DW$255, DW_AT_name("GPAMUX2")
    2304                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_GPAMUX2")
    2305                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2306                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2307              
    2308              $C$DW$256       .dwtag  DW_TAG_member
    2309                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    2310                      .dwattr $C$DW$256, DW_AT_name("GPADIR")
    2311                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_GPADIR")
    2312                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2313                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2314              
    2315              $C$DW$257       .dwtag  DW_TAG_member
    2316                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    2317                      .dwattr $C$DW$257, DW_AT_name("GPAPUD")
    2318                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_GPAPUD")
    2319                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2320                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2321              
    2322              $C$DW$258       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$23)
    2324                      .dwattr $C$DW$258, DW_AT_name("rsvd_1")
    2325                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_rsvd_1")
    2326                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2327                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2328              
    2329              $C$DW$259       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2331                      .dwattr $C$DW$259, DW_AT_name("GPBCTRL")
    2332                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_GPBCTRL")
    2333                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2334                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2335              
    2336              $C$DW$260       .dwtag  DW_TAG_member
    2337                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    2338                      .dwattr $C$DW$260, DW_AT_name("GPBQSEL1")
    2339                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_GPBQSEL1")
    2340                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2341                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2342              
    2343              $C$DW$261       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$23)
    2345                      .dwattr $C$DW$261, DW_AT_name("rsvd_2")
    2346                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_rsvd_2")
    2347                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2348                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2349              
    2350              $C$DW$262       .dwtag  DW_TAG_member
    2351                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0501610                         PAGE   44

    2352                      .dwattr $C$DW$262, DW_AT_name("GPBMUX1")
    2353                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_GPBMUX1")
    2354                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2355                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2356              
    2357              $C$DW$263       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$23)
    2359                      .dwattr $C$DW$263, DW_AT_name("rsvd_3")
    2360                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_rsvd_3")
    2361                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2362                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2363              
    2364              $C$DW$264       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2366                      .dwattr $C$DW$264, DW_AT_name("GPBDIR")
    2367                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_GPBDIR")
    2368                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2369                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2370              
    2371              $C$DW$265       .dwtag  DW_TAG_member
    2372                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2373                      .dwattr $C$DW$265, DW_AT_name("GPBPUD")
    2374                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_GPBPUD")
    2375                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2376                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2377              
    2378              $C$DW$266       .dwtag  DW_TAG_member
    2379                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$24)
    2380                      .dwattr $C$DW$266, DW_AT_name("rsvd_4")
    2381                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_rsvd_4")
    2382                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2383                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2384              
    2385              $C$DW$267       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2387                      .dwattr $C$DW$267, DW_AT_name("AIOMUX1")
    2388                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_AIOMUX1")
    2389                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2390                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2391              
    2392              $C$DW$268       .dwtag  DW_TAG_member
    2393                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$23)
    2394                      .dwattr $C$DW$268, DW_AT_name("rsvd_5")
    2395                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_rsvd_5")
    2396                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2397                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2398              
    2399              $C$DW$269       .dwtag  DW_TAG_member
    2400                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    2401                      .dwattr $C$DW$269, DW_AT_name("AIODIR")
    2402                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_AIODIR")
    2403                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2404                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2405              
    2406              $C$DW$270       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0501610                         PAGE   45

    2407                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$25)
    2408                      .dwattr $C$DW$270, DW_AT_name("rsvd_6")
    2409                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_rsvd_6")
    2410                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2411                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2412              
    2413              $C$DW$271       .dwtag  DW_TAG_member
    2414                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    2415                      .dwattr $C$DW$271, DW_AT_name("GPADAT")
    2416                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_GPADAT")
    2417                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2418                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2419              
    2420              $C$DW$272       .dwtag  DW_TAG_member
    2421                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    2422                      .dwattr $C$DW$272, DW_AT_name("GPASET")
    2423                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_GPASET")
    2424                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2425                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2426              
    2427              $C$DW$273       .dwtag  DW_TAG_member
    2428                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    2429                      .dwattr $C$DW$273, DW_AT_name("GPACLEAR")
    2430                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_GPACLEAR")
    2431                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2432                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2433              
    2434              $C$DW$274       .dwtag  DW_TAG_member
    2435                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    2436                      .dwattr $C$DW$274, DW_AT_name("GPATOGGLE")
    2437                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_GPATOGGLE")
    2438                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2439                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2440              
    2441              $C$DW$275       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    2443                      .dwattr $C$DW$275, DW_AT_name("GPBDAT")
    2444                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_GPBDAT")
    2445                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2446                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2447              
    2448              $C$DW$276       .dwtag  DW_TAG_member
    2449                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    2450                      .dwattr $C$DW$276, DW_AT_name("GPBSET")
    2451                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_GPBSET")
    2452                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2453                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2454              
    2455              $C$DW$277       .dwtag  DW_TAG_member
    2456                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    2457                      .dwattr $C$DW$277, DW_AT_name("GPBCLEAR")
    2458                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_GPBCLEAR")
    2459                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2460                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2461              
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0501610                         PAGE   46

    2462              $C$DW$278       .dwtag  DW_TAG_member
    2463                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    2464                      .dwattr $C$DW$278, DW_AT_name("GPBTOGGLE")
    2465                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_GPBTOGGLE")
    2466                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2467                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2468              
    2469              $C$DW$279       .dwtag  DW_TAG_member
    2470                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$26)
    2471                      .dwattr $C$DW$279, DW_AT_name("rsvd_7")
    2472                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_rsvd_7")
    2473                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2474                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2475              
    2476              $C$DW$280       .dwtag  DW_TAG_member
    2477                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    2478                      .dwattr $C$DW$280, DW_AT_name("AIODAT")
    2479                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_AIODAT")
    2480                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2481                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2482              
    2483              $C$DW$281       .dwtag  DW_TAG_member
    2484                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    2485                      .dwattr $C$DW$281, DW_AT_name("AIOSET")
    2486                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_AIOSET")
    2487                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2488                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2489              
    2490              $C$DW$282       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    2492                      .dwattr $C$DW$282, DW_AT_name("AIOCLEAR")
    2493                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_AIOCLEAR")
    2494                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2495                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2496              
    2497              $C$DW$283       .dwtag  DW_TAG_member
    2498                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    2499                      .dwattr $C$DW$283, DW_AT_name("AIOTOGGLE")
    2500                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_AIOTOGGLE")
    2501                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2502                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2503              
    2504              $C$DW$284       .dwtag  DW_TAG_member
    2505                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$27)
    2506                      .dwattr $C$DW$284, DW_AT_name("GPIOXINTnSEL")
    2507                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    2508                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2509                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2510              
    2511              $C$DW$285       .dwtag  DW_TAG_member
    2512                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$28)
    2513                      .dwattr $C$DW$285, DW_AT_name("rsvd_8")
    2514                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_rsvd_8")
    2515                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2516                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0501610                         PAGE   47

    2517              
    2518              $C$DW$286       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    2520                      .dwattr $C$DW$286, DW_AT_name("GPIOLPMSEL")
    2521                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    2522                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2523                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2524              
    2525                      .dwendtag $C$DW$T$29
    2526              
    2527              $C$DW$T$51      .dwtag  DW_TAG_typedef
    2528                      .dwattr $C$DW$T$51, DW_AT_name("GPIO_Obj")
    2529                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$29)
    2530                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2531              
    2532              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2533                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
    2534                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    2535              
    2536              $C$DW$T$53      .dwtag  DW_TAG_typedef
    2537                      .dwattr $C$DW$T$53, DW_AT_name("GPIO_Handle")
    2538                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2539                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2540              
    2541              $C$DW$287       .dwtag  DW_TAG_TI_far_type
    2542                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$53)
    2543              
    2544              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2545                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$287)
    2546              
    2547              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2548                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2549              
    2550              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2551                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2552                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2553              
    2554              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2555                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2556                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2557                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2558              
    2559              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2560                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2561                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2562                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2563              
    2564              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2565                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2566                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2567                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2568              
    2569              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2570                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2571                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0501610                         PAGE   48

    2572                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2573              
    2574              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2575                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2576                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2577                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2578              
    2579              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2580                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2581                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2582                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2583              
