TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.1.LTS *
       3              ;* Date/Time created: Wed Jan 04 18:41:23 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.1.LTS Copyright (c) 1996-2015
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   52

    2671              
    2672              $C$DW$420       .dwtag  DW_TAG_enumerator
    2673                      .dwattr $C$DW$420, DW_AT_name("ADC_ResultNumber_11")
    2674                      .dwattr $C$DW$420, DW_AT_const_value(0x0b)
    2675              
    2676              $C$DW$421       .dwtag  DW_TAG_enumerator
    2677                      .dwattr $C$DW$421, DW_AT_name("ADC_ResultNumber_12")
    2678                      .dwattr $C$DW$421, DW_AT_const_value(0x0c)
    2679              
    2680              $C$DW$422       .dwtag  DW_TAG_enumerator
    2681                      .dwattr $C$DW$422, DW_AT_name("ADC_ResultNumber_13")
    2682                      .dwattr $C$DW$422, DW_AT_const_value(0x0d)
    2683              
    2684              $C$DW$423       .dwtag  DW_TAG_enumerator
    2685                      .dwattr $C$DW$423, DW_AT_name("ADC_ResultNumber_14")
    2686                      .dwattr $C$DW$423, DW_AT_const_value(0x0e)
    2687              
    2688              $C$DW$424       .dwtag  DW_TAG_enumerator
    2689                      .dwattr $C$DW$424, DW_AT_name("ADC_ResultNumber_15")
    2690                      .dwattr $C$DW$424, DW_AT_const_value(0x0f)
    2691              
    2692                      .dwendtag $C$DW$T$210
    2693              
    2694              $C$DW$T$211     .dwtag  DW_TAG_typedef
    2695                      .dwattr $C$DW$T$211, DW_AT_name("ADC_ResultNumber_e")
    2696                      .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$210)
    2697                      .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    2698              
    2699              
    2700              $C$DW$T$213     .dwtag  DW_TAG_enumeration_type
    2701                      .dwattr $C$DW$T$213, DW_AT_byte_size(0x01)
    2702              $C$DW$425       .dwtag  DW_TAG_enumerator
    2703                      .dwattr $C$DW$425, DW_AT_name("PIE_GroupNumber_1")
    2704                      .dwattr $C$DW$425, DW_AT_const_value(0x00)
    2705              
    2706              $C$DW$426       .dwtag  DW_TAG_enumerator
    2707                      .dwattr $C$DW$426, DW_AT_name("PIE_GroupNumber_2")
    2708                      .dwattr $C$DW$426, DW_AT_const_value(0x01)
    2709              
    2710              $C$DW$427       .dwtag  DW_TAG_enumerator
    2711                      .dwattr $C$DW$427, DW_AT_name("PIE_GroupNumber_3")
    2712                      .dwattr $C$DW$427, DW_AT_const_value(0x02)
    2713              
    2714              $C$DW$428       .dwtag  DW_TAG_enumerator
    2715                      .dwattr $C$DW$428, DW_AT_name("PIE_GroupNumber_4")
    2716                      .dwattr $C$DW$428, DW_AT_const_value(0x03)
    2717              
    2718              $C$DW$429       .dwtag  DW_TAG_enumerator
    2719                      .dwattr $C$DW$429, DW_AT_name("PIE_GroupNumber_5")
    2720                      .dwattr $C$DW$429, DW_AT_const_value(0x04)
    2721              
    2722              $C$DW$430       .dwtag  DW_TAG_enumerator
    2723                      .dwattr $C$DW$430, DW_AT_name("PIE_GroupNumber_6")
    2724                      .dwattr $C$DW$430, DW_AT_const_value(0x05)
    2725              
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   53

    2726              $C$DW$431       .dwtag  DW_TAG_enumerator
    2727                      .dwattr $C$DW$431, DW_AT_name("PIE_GroupNumber_7")
    2728                      .dwattr $C$DW$431, DW_AT_const_value(0x06)
    2729              
    2730              $C$DW$432       .dwtag  DW_TAG_enumerator
    2731                      .dwattr $C$DW$432, DW_AT_name("PIE_GroupNumber_8")
    2732                      .dwattr $C$DW$432, DW_AT_const_value(0x07)
    2733              
    2734              $C$DW$433       .dwtag  DW_TAG_enumerator
    2735                      .dwattr $C$DW$433, DW_AT_name("PIE_GroupNumber_9")
    2736                      .dwattr $C$DW$433, DW_AT_const_value(0x08)
    2737              
    2738              $C$DW$434       .dwtag  DW_TAG_enumerator
    2739                      .dwattr $C$DW$434, DW_AT_name("PIE_GroupNumber_10")
    2740                      .dwattr $C$DW$434, DW_AT_const_value(0x09)
    2741              
    2742              $C$DW$435       .dwtag  DW_TAG_enumerator
    2743                      .dwattr $C$DW$435, DW_AT_name("PIE_GroupNumber_11")
    2744                      .dwattr $C$DW$435, DW_AT_const_value(0x0a)
    2745              
    2746              $C$DW$436       .dwtag  DW_TAG_enumerator
    2747                      .dwattr $C$DW$436, DW_AT_name("PIE_GroupNumber_12")
    2748                      .dwattr $C$DW$436, DW_AT_const_value(0x0b)
    2749              
    2750                      .dwendtag $C$DW$T$213
    2751              
    2752              $C$DW$T$214     .dwtag  DW_TAG_typedef
    2753                      .dwattr $C$DW$T$214, DW_AT_name("PIE_GroupNumber_e")
    2754                      .dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$213)
    2755                      .dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
    2756              
    2757              
    2758              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2759                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    2760                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    2761              $C$DW$437       .dwtag  DW_TAG_member
    2762                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$23)
    2763                      .dwattr $C$DW$437, DW_AT_name("ADCRESULT")
    2764                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_ADCRESULT")
    2765                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2766                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    2767              
    2768              $C$DW$438       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$24)
    2770                      .dwattr $C$DW$438, DW_AT_name("resvd_1")
    2771                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_resvd_1")
    2772                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2773                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    2774              
    2775              $C$DW$439       .dwtag  DW_TAG_member
    2776                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$22)
    2777                      .dwattr $C$DW$439, DW_AT_name("ADCCTL1")
    2778                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_ADCCTL1")
    2779                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    2780                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   54

    2781              
    2782              $C$DW$440       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$22)
    2784                      .dwattr $C$DW$440, DW_AT_name("ADCCTL2")
    2785                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_ADCCTL2")
    2786                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    2787                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    2788              
    2789              $C$DW$441       .dwtag  DW_TAG_member
    2790                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$25)
    2791                      .dwattr $C$DW$441, DW_AT_name("rsvd_2")
    2792                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_rsvd_2")
    2793                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    2794                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    2795              
    2796              $C$DW$442       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$22)
    2798                      .dwattr $C$DW$442, DW_AT_name("ADCINTFLG")
    2799                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_ADCINTFLG")
    2800                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    2801                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    2802              
    2803              $C$DW$443       .dwtag  DW_TAG_member
    2804                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$22)
    2805                      .dwattr $C$DW$443, DW_AT_name("ADCINTFLGCLR")
    2806                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    2807                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    2808                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    2809              
    2810              $C$DW$444       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$22)
    2812                      .dwattr $C$DW$444, DW_AT_name("ADCINTOVF")
    2813                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_ADCINTOVF")
    2814                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    2815                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    2816              
    2817              $C$DW$445       .dwtag  DW_TAG_member
    2818                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$22)
    2819                      .dwattr $C$DW$445, DW_AT_name("ADCINTOVFCLR")
    2820                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    2821                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    2822                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    2823              
    2824              $C$DW$446       .dwtag  DW_TAG_member
    2825                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$26)
    2826                      .dwattr $C$DW$446, DW_AT_name("INTSELxNy")
    2827                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_INTSELxNy")
    2828                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    2829                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    2830              
    2831              $C$DW$447       .dwtag  DW_TAG_member
    2832                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$27)
    2833                      .dwattr $C$DW$447, DW_AT_name("rsvd_3")
    2834                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_rsvd_3")
    2835                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   55

    2836                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    2837              
    2838              $C$DW$448       .dwtag  DW_TAG_member
    2839                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$22)
    2840                      .dwattr $C$DW$448, DW_AT_name("SOCPRICTRL")
    2841                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_SOCPRICTRL")
    2842                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    2843                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    2844              
    2845              $C$DW$449       .dwtag  DW_TAG_member
    2846                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$22)
    2847                      .dwattr $C$DW$449, DW_AT_name("rsvd_4")
    2848                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_rsvd_4")
    2849                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    2850                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    2851              
    2852              $C$DW$450       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$22)
    2854                      .dwattr $C$DW$450, DW_AT_name("ADCSAMPLEMODE")
    2855                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    2856                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    2857                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    2858              
    2859              $C$DW$451       .dwtag  DW_TAG_member
    2860                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$22)
    2861                      .dwattr $C$DW$451, DW_AT_name("rsvd_5")
    2862                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_rsvd_5")
    2863                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    2864                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    2865              
    2866              $C$DW$452       .dwtag  DW_TAG_member
    2867                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$22)
    2868                      .dwattr $C$DW$452, DW_AT_name("ADCINTSOCSEL1")
    2869                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    2870                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    2871                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    2872              
    2873              $C$DW$453       .dwtag  DW_TAG_member
    2874                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$22)
    2875                      .dwattr $C$DW$453, DW_AT_name("ADCINTSOCSEL2")
    2876                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    2877                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    2878                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    2879              
    2880              $C$DW$454       .dwtag  DW_TAG_member
    2881                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$25)
    2882                      .dwattr $C$DW$454, DW_AT_name("rsvd_6")
    2883                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_rsvd_6")
    2884                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    2885                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    2886              
    2887              $C$DW$455       .dwtag  DW_TAG_member
    2888                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$22)
    2889                      .dwattr $C$DW$455, DW_AT_name("ADCSOCFLG1")
    2890                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_ADCSOCFLG1")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   56

    2891                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    2892                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    2893              
    2894              $C$DW$456       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$22)
    2896                      .dwattr $C$DW$456, DW_AT_name("rsvd_7")
    2897                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_rsvd_7")
    2898                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    2899                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    2900              
    2901              $C$DW$457       .dwtag  DW_TAG_member
    2902                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$22)
    2903                      .dwattr $C$DW$457, DW_AT_name("ADCSOCFRC1")
    2904                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    2905                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    2906                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    2907              
    2908              $C$DW$458       .dwtag  DW_TAG_member
    2909                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$22)
    2910                      .dwattr $C$DW$458, DW_AT_name("rsvd_8")
    2911                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_rsvd_8")
    2912                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    2913                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    2914              
    2915              $C$DW$459       .dwtag  DW_TAG_member
    2916                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$22)
    2917                      .dwattr $C$DW$459, DW_AT_name("ADCSOCOVF1")
    2918                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    2919                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    2920                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    2921              
    2922              $C$DW$460       .dwtag  DW_TAG_member
    2923                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$22)
    2924                      .dwattr $C$DW$460, DW_AT_name("rsvd_9")
    2925                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_rsvd_9")
    2926                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    2927                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    2928              
    2929              $C$DW$461       .dwtag  DW_TAG_member
    2930                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$22)
    2931                      .dwattr $C$DW$461, DW_AT_name("ADCSOCOVFCLR1")
    2932                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    2933                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    2934                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    2935              
    2936              $C$DW$462       .dwtag  DW_TAG_member
    2937                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$22)
    2938                      .dwattr $C$DW$462, DW_AT_name("rsvd_10")
    2939                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_rsvd_10")
    2940                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    2941                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    2942              
    2943              $C$DW$463       .dwtag  DW_TAG_member
    2944                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$23)
    2945                      .dwattr $C$DW$463, DW_AT_name("ADCSOCxCTL")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   57

    2946                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    2947                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    2948                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    2949              
    2950              $C$DW$464       .dwtag  DW_TAG_member
    2951                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$23)
    2952                      .dwattr $C$DW$464, DW_AT_name("rsvd_11")
    2953                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_rsvd_11")
    2954                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    2955                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    2956              
    2957              $C$DW$465       .dwtag  DW_TAG_member
    2958                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$22)
    2959                      .dwattr $C$DW$465, DW_AT_name("ADCREFTRIM")
    2960                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_ADCREFTRIM")
    2961                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    2962                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    2963              
    2964              $C$DW$466       .dwtag  DW_TAG_member
    2965                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$22)
    2966                      .dwattr $C$DW$466, DW_AT_name("ADCOFFTRIM")
    2967                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    2968                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    2969                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    2970              
    2971              $C$DW$467       .dwtag  DW_TAG_member
    2972                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$28)
    2973                      .dwattr $C$DW$467, DW_AT_name("resvd_12")
    2974                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_resvd_12")
    2975                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    2976                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    2977              
    2978              $C$DW$468       .dwtag  DW_TAG_member
    2979                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$22)
    2980                      .dwattr $C$DW$468, DW_AT_name("ADCREV")
    2981                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_ADCREV")
    2982                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    2983                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    2984              
    2985                      .dwendtag $C$DW$T$29
    2986              
    2987              $C$DW$T$216     .dwtag  DW_TAG_typedef
    2988                      .dwattr $C$DW$T$216, DW_AT_name("ADC_Obj")
    2989                      .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$29)
    2990                      .dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
    2991              
    2992              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    2993                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$29)
    2994                      .dwattr $C$DW$T$122, DW_AT_address_class(0x20)
    2995              
    2996              $C$DW$T$123     .dwtag  DW_TAG_typedef
    2997                      .dwattr $C$DW$T$123, DW_AT_name("ADC_Handle")
    2998                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    2999                      .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    3000              
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   58

    3001              
    3002              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3003                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    3004                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    3005              $C$DW$469       .dwtag  DW_TAG_member
    3006                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$22)
    3007                      .dwattr $C$DW$469, DW_AT_name("XCLK")
    3008                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_XCLK")
    3009                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3010                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3011              
    3012              $C$DW$470       .dwtag  DW_TAG_member
    3013                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$22)
    3014                      .dwattr $C$DW$470, DW_AT_name("rsvd_1")
    3015                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_rsvd_1")
    3016                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3017                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3018              
    3019              $C$DW$471       .dwtag  DW_TAG_member
    3020                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$22)
    3021                      .dwattr $C$DW$471, DW_AT_name("CLKCTL")
    3022                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_CLKCTL")
    3023                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3024                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3025              
    3026              $C$DW$472       .dwtag  DW_TAG_member
    3027                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$30)
    3028                      .dwattr $C$DW$472, DW_AT_name("rsvd_2")
    3029                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_rsvd_2")
    3030                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3031                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3032              
    3033              $C$DW$473       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$22)
    3035                      .dwattr $C$DW$473, DW_AT_name("LOSPCP")
    3036                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_LOSPCP")
    3037                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3038                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3039              
    3040              $C$DW$474       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$22)
    3042                      .dwattr $C$DW$474, DW_AT_name("PCLKCR0")
    3043                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_PCLKCR0")
    3044                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3045                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3046              
    3047              $C$DW$475       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$22)
    3049                      .dwattr $C$DW$475, DW_AT_name("PCLKCR1")
    3050                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_PCLKCR1")
    3051                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3052                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3053              
    3054              $C$DW$476       .dwtag  DW_TAG_member
    3055                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   59

    3056                      .dwattr $C$DW$476, DW_AT_name("rsvd_3")
    3057                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_rsvd_3")
    3058                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3059                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3060              
    3061              $C$DW$477       .dwtag  DW_TAG_member
    3062                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$22)
    3063                      .dwattr $C$DW$477, DW_AT_name("PCLKCR3")
    3064                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_PCLKCR3")
    3065                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3066                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3067              
    3068                      .dwendtag $C$DW$T$31
    3069              
    3070              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    3071                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$31)
    3072                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    3073              
    3074              $C$DW$T$125     .dwtag  DW_TAG_typedef
    3075                      .dwattr $C$DW$T$125, DW_AT_name("CLK_Handle")
    3076                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    3077                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    3078              
    3079              
    3080              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3081                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    3082                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    3083              $C$DW$478       .dwtag  DW_TAG_member
    3084                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$32)
    3085                      .dwattr $C$DW$478, DW_AT_name("tmp")
    3086                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_tmp")
    3087                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3088                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3089              
    3090                      .dwendtag $C$DW$T$33
    3091              
    3092              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    3093                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$33)
    3094                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    3095              
    3096              $C$DW$T$127     .dwtag  DW_TAG_typedef
    3097                      .dwattr $C$DW$T$127, DW_AT_name("CPU_Handle")
    3098                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    3099                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    3100              
    3101              
    3102              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3103                      .dwattr $C$DW$T$36, DW_AT_name("_CTRL_Version_")
    3104                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    3105              $C$DW$479       .dwtag  DW_TAG_member
    3106                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$21)
    3107                      .dwattr $C$DW$479, DW_AT_name("rsvd")
    3108                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_rsvd")
    3109                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3110                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   60

    3111              
    3112              $C$DW$480       .dwtag  DW_TAG_member
    3113                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$35)
    3114                      .dwattr $C$DW$480, DW_AT_name("targetProc")
    3115                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_targetProc")
    3116                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3117                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3118              
    3119              $C$DW$481       .dwtag  DW_TAG_member
    3120                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$21)
    3121                      .dwattr $C$DW$481, DW_AT_name("major")
    3122                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_major")
    3123                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3124                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3125              
    3126              $C$DW$482       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$21)
    3128                      .dwattr $C$DW$482, DW_AT_name("minor")
    3129                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_minor")
    3130                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3131                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3132              
    3133                      .dwendtag $C$DW$T$36
    3134              
    3135              $C$DW$T$166     .dwtag  DW_TAG_typedef
    3136                      .dwattr $C$DW$T$166, DW_AT_name("CTRL_Version")
    3137                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$36)
    3138                      .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    3139              
    3140              
    3141              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3142                      .dwattr $C$DW$T$44, DW_AT_name("_DRV8305_Obj_")
    3143                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    3144              $C$DW$483       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$38)
    3146                      .dwattr $C$DW$483, DW_AT_name("spiHandle")
    3147                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_spiHandle")
    3148                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3149                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3150              
    3151              $C$DW$484       .dwtag  DW_TAG_member
    3152                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$40)
    3153                      .dwattr $C$DW$484, DW_AT_name("gpioHandle")
    3154                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_gpioHandle")
    3155                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3156                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3157              
    3158              $C$DW$485       .dwtag  DW_TAG_member
    3159                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$42)
    3160                      .dwattr $C$DW$485, DW_AT_name("gpioNumber")
    3161                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_gpioNumber")
    3162                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3163                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3164              
    3165              $C$DW$486       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   61

    3166                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$43)
    3167                      .dwattr $C$DW$486, DW_AT_name("RxTimeOut")
    3168                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_RxTimeOut")
    3169                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3170                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3171              
    3172              $C$DW$487       .dwtag  DW_TAG_member
    3173                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$43)
    3174                      .dwattr $C$DW$487, DW_AT_name("enableTimeOut")
    3175                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_enableTimeOut")
    3176                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3177                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3178              
    3179                      .dwendtag $C$DW$T$44
    3180              
    3181              $C$DW$T$155     .dwtag  DW_TAG_typedef
    3182                      .dwattr $C$DW$T$155, DW_AT_name("DRV8305_Obj")
    3183                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$44)
    3184                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    3185              
    3186              $C$DW$T$153     .dwtag  DW_TAG_pointer_type
    3187                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$44)
    3188                      .dwattr $C$DW$T$153, DW_AT_address_class(0x20)
    3189              
    3190              $C$DW$T$154     .dwtag  DW_TAG_typedef
    3191                      .dwattr $C$DW$T$154, DW_AT_name("DRV8305_Handle")
    3192                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$153)
    3193                      .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    3194              
    3195              
    3196              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3197                      .dwattr $C$DW$T$51, DW_AT_name("_DRV_SPI_8305_Ctrl05_t_")
    3198                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
    3199              $C$DW$488       .dwtag  DW_TAG_member
    3200                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$46)
    3201                      .dwattr $C$DW$488, DW_AT_name("IDRIVEP_HS")
    3202                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_IDRIVEP_HS")
    3203                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3204                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3205              
    3206              $C$DW$489       .dwtag  DW_TAG_member
    3207                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$48)
    3208                      .dwattr $C$DW$489, DW_AT_name("IDRIVEN_HS")
    3209                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_IDRIVEN_HS")
    3210                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3211                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3212              
    3213              $C$DW$490       .dwtag  DW_TAG_member
    3214                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$50)
    3215                      .dwattr $C$DW$490, DW_AT_name("TDRIVEN")
    3216                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_TDRIVEN")
    3217                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3218                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3219              
    3220              $C$DW$491       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   62

    3221                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$43)
    3222                      .dwattr $C$DW$491, DW_AT_name("CTRL05_RSV1")
    3223                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_CTRL05_RSV1")
    3224                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3225                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3226              
    3227                      .dwendtag $C$DW$T$51
    3228              
    3229              $C$DW$T$103     .dwtag  DW_TAG_typedef
    3230                      .dwattr $C$DW$T$103, DW_AT_name("DRV_SPI_8305_Ctrl05_t_")
    3231                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$51)
    3232                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    3233              
    3234              
    3235              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3236                      .dwattr $C$DW$T$58, DW_AT_name("_DRV_SPI_8305_Ctrl06_t_")
    3237                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
    3238              $C$DW$492       .dwtag  DW_TAG_member
    3239                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$53)
    3240                      .dwattr $C$DW$492, DW_AT_name("IDRIVEP_LS")
    3241                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_IDRIVEP_LS")
    3242                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3243                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3244              
    3245              $C$DW$493       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$55)
    3247                      .dwattr $C$DW$493, DW_AT_name("IDRIVEN_LS")
    3248                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_IDRIVEN_LS")
    3249                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3250                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3251              
    3252              $C$DW$494       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$57)
    3254                      .dwattr $C$DW$494, DW_AT_name("TDRIVEP")
    3255                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_TDRIVEP")
    3256                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3257                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3258              
    3259              $C$DW$495       .dwtag  DW_TAG_member
    3260                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$43)
    3261                      .dwattr $C$DW$495, DW_AT_name("CTRL06_RSV1")
    3262                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_CTRL06_RSV1")
    3263                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3264                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3265              
    3266                      .dwendtag $C$DW$T$58
    3267              
    3268              $C$DW$T$104     .dwtag  DW_TAG_typedef
    3269                      .dwattr $C$DW$T$104, DW_AT_name("DRV_SPI_8305_Ctrl06_t_")
    3270                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$58)
    3271                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3272              
    3273              
    3274              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3275                      .dwattr $C$DW$T$69, DW_AT_name("_DRV_SPI_8305_Ctrl07_t_")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   63

    3276                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x06)
    3277              $C$DW$496       .dwtag  DW_TAG_member
    3278                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$60)
    3279                      .dwattr $C$DW$496, DW_AT_name("TVDS")
    3280                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_TVDS")
    3281                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3282                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3283              
    3284              $C$DW$497       .dwtag  DW_TAG_member
    3285                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$62)
    3286                      .dwattr $C$DW$497, DW_AT_name("TBLANK")
    3287                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_TBLANK")
    3288                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3289                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3290              
    3291              $C$DW$498       .dwtag  DW_TAG_member
    3292                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$64)
    3293                      .dwattr $C$DW$498, DW_AT_name("DEAD_TIME")
    3294                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_DEAD_TIME")
    3295                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3296                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3297              
    3298              $C$DW$499       .dwtag  DW_TAG_member
    3299                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$66)
    3300                      .dwattr $C$DW$499, DW_AT_name("PWM_MODE")
    3301                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_PWM_MODE")
    3302                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3303                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3304              
    3305              $C$DW$500       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$68)
    3307                      .dwattr $C$DW$500, DW_AT_name("COMM_OPT")
    3308                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_COMM_OPT")
    3309                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3310                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3311              
    3312              $C$DW$501       .dwtag  DW_TAG_member
    3313                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$43)
    3314                      .dwattr $C$DW$501, DW_AT_name("CTRL07_RSV1")
    3315                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_CTRL07_RSV1")
    3316                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3317                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3318              
    3319                      .dwendtag $C$DW$T$69
    3320              
    3321              $C$DW$T$105     .dwtag  DW_TAG_typedef
    3322                      .dwattr $C$DW$T$105, DW_AT_name("DRV_SPI_8305_Ctrl07_t_")
    3323                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$69)
    3324                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    3325              
    3326              
    3327              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3328                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8305_Ctrl08_t_")
    3329                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x01)
    3330              $C$DW$502       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   64

    3331                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$21)
    3332                      .dwattr $C$DW$502, DW_AT_name("CTRL08_RSV1")
    3333                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_CTRL08_RSV1")
    3334                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3335                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3336              
    3337                      .dwendtag $C$DW$T$70
    3338              
    3339              $C$DW$T$106     .dwtag  DW_TAG_typedef
    3340                      .dwattr $C$DW$T$106, DW_AT_name("DRV_SPI_8305_Ctrl08_t_")
    3341                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$70)
    3342                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    3343              
    3344              
    3345              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    3346                      .dwattr $C$DW$T$73, DW_AT_name("_DRV_SPI_8305_Ctrl09_t_")
    3347                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x0a)
    3348              $C$DW$503       .dwtag  DW_TAG_member
    3349                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$43)
    3350                      .dwattr $C$DW$503, DW_AT_name("SET_VCPH_UV")
    3351                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_SET_VCPH_UV")
    3352                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3353                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3354              
    3355              $C$DW$504       .dwtag  DW_TAG_member
    3356                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$43)
    3357                      .dwattr $C$DW$504, DW_AT_name("CLR_FLTS")
    3358                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_CLR_FLTS")
    3359                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3360                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3361              
    3362              $C$DW$505       .dwtag  DW_TAG_member
    3363                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$43)
    3364                      .dwattr $C$DW$505, DW_AT_name("SLEEP")
    3365                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_SLEEP")
    3366                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3367                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3368              
    3369              $C$DW$506       .dwtag  DW_TAG_member
    3370                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$43)
    3371                      .dwattr $C$DW$506, DW_AT_name("WD_EN")
    3372                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_WD_EN")
    3373                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3374                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3375              
    3376              $C$DW$507       .dwtag  DW_TAG_member
    3377                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$43)
    3378                      .dwattr $C$DW$507, DW_AT_name("DIS_SNS_OCP")
    3379                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_DIS_SNS_OCP")
    3380                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3381                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3382              
    3383              $C$DW$508       .dwtag  DW_TAG_member
    3384                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$72)
    3385                      .dwattr $C$DW$508, DW_AT_name("WD_DLY")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   65

    3386                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_WD_DLY")
    3387                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3388                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3389              
    3390              $C$DW$509       .dwtag  DW_TAG_member
    3391                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$43)
    3392                      .dwattr $C$DW$509, DW_AT_name("EN_SNS_CLAMP")
    3393                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_EN_SNS_CLAMP")
    3394                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3395                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3396              
    3397              $C$DW$510       .dwtag  DW_TAG_member
    3398                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$43)
    3399                      .dwattr $C$DW$510, DW_AT_name("DIS_GDRV_FAULT")
    3400                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_DIS_GDRV_FAULT")
    3401                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3402                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3403              
    3404              $C$DW$511       .dwtag  DW_TAG_member
    3405                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$43)
    3406                      .dwattr $C$DW$511, DW_AT_name("DISABLE")
    3407                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_DISABLE")
    3408                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3409                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3410              
    3411              $C$DW$512       .dwtag  DW_TAG_member
    3412                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$43)
    3413                      .dwattr $C$DW$512, DW_AT_name("FLIP_OTS")
    3414                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_FLIP_OTS")
    3415                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3416                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3417              
    3418                      .dwendtag $C$DW$T$73
    3419              
    3420              $C$DW$T$107     .dwtag  DW_TAG_typedef
    3421                      .dwattr $C$DW$T$107, DW_AT_name("DRV_SPI_8305_Ctrl09_t_")
    3422                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$73)
    3423                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    3424              
    3425              
    3426              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    3427                      .dwattr $C$DW$T$82, DW_AT_name("_DRV_SPI_8305_Ctrl0A_t_")
    3428                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x07)
    3429              $C$DW$513       .dwtag  DW_TAG_member
    3430                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$75)
    3431                      .dwattr $C$DW$513, DW_AT_name("GAIN_CS1")
    3432                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_GAIN_CS1")
    3433                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3434                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3435              
    3436              $C$DW$514       .dwtag  DW_TAG_member
    3437                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$77)
    3438                      .dwattr $C$DW$514, DW_AT_name("GAIN_CS2")
    3439                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_GAIN_CS2")
    3440                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   66

    3441                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3442              
    3443              $C$DW$515       .dwtag  DW_TAG_member
    3444                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$79)
    3445                      .dwattr $C$DW$515, DW_AT_name("GAIN_CS3")
    3446                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_GAIN_CS3")
    3447                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3448                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3449              
    3450              $C$DW$516       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$81)
    3452                      .dwattr $C$DW$516, DW_AT_name("CS_BLANK")
    3453                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_CS_BLANK")
    3454                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3455                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3456              
    3457              $C$DW$517       .dwtag  DW_TAG_member
    3458                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$43)
    3459                      .dwattr $C$DW$517, DW_AT_name("DC_CAL_CH1")
    3460                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_DC_CAL_CH1")
    3461                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3462                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3463              
    3464              $C$DW$518       .dwtag  DW_TAG_member
    3465                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$43)
    3466                      .dwattr $C$DW$518, DW_AT_name("DC_CAL_CH2")
    3467                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_DC_CAL_CH2")
    3468                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3469                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3470              
    3471              $C$DW$519       .dwtag  DW_TAG_member
    3472                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$43)
    3473                      .dwattr $C$DW$519, DW_AT_name("DC_CAL_CH3")
    3474                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_DC_CAL_CH3")
    3475                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3476                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    3477              
    3478                      .dwendtag $C$DW$T$82
    3479              
    3480              $C$DW$T$108     .dwtag  DW_TAG_typedef
    3481                      .dwattr $C$DW$T$108, DW_AT_name("DRV_SPI_8305_Ctrl0A_t_")
    3482                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$82)
    3483                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    3484              
    3485              
    3486              $C$DW$T$89      .dwtag  DW_TAG_structure_type
    3487                      .dwattr $C$DW$T$89, DW_AT_name("_DRV_SPI_8305_Ctrl0B_t_")
    3488                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x08)
    3489              $C$DW$520       .dwtag  DW_TAG_member
    3490                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$84)
    3491                      .dwattr $C$DW$520, DW_AT_name("VREG_UV_LEVEL")
    3492                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_VREG_UV_LEVEL")
    3493                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3494                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    3495              
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   67

    3496              $C$DW$521       .dwtag  DW_TAG_member
    3497                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$43)
    3498                      .dwattr $C$DW$521, DW_AT_name("DIS_PWRGD")
    3499                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_DIS_PWRGD")
    3500                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3501                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    3502              
    3503              $C$DW$522       .dwtag  DW_TAG_member
    3504                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$86)
    3505                      .dwattr $C$DW$522, DW_AT_name("SLP_DLY")
    3506                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_SLP_DLY")
    3507                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3508                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    3509              
    3510              $C$DW$523       .dwtag  DW_TAG_member
    3511                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$43)
    3512                      .dwattr $C$DW$523, DW_AT_name("CTRL0B_RSV1")
    3513                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_CTRL0B_RSV1")
    3514                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3515                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    3516              
    3517              $C$DW$524       .dwtag  DW_TAG_member
    3518                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$43)
    3519                      .dwattr $C$DW$524, DW_AT_name("CTRL0B_RSV2")
    3520                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_CTRL0B_RSV2")
    3521                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3522                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    3523              
    3524              $C$DW$525       .dwtag  DW_TAG_member
    3525                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$43)
    3526                      .dwattr $C$DW$525, DW_AT_name("CTRL0B_RSV3")
    3527                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_CTRL0B_RSV3")
    3528                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3529                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    3530              
    3531              $C$DW$526       .dwtag  DW_TAG_member
    3532                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$88)
    3533                      .dwattr $C$DW$526, DW_AT_name("VREF_SCALING")
    3534                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_VREF_SCALING")
    3535                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3536                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    3537              
    3538              $C$DW$527       .dwtag  DW_TAG_member
    3539                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$43)
    3540                      .dwattr $C$DW$527, DW_AT_name("CTRL0B_RSV4")
    3541                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_CTRL0B_RSV4")
    3542                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3543                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    3544              
    3545                      .dwendtag $C$DW$T$89
    3546              
    3547              $C$DW$T$109     .dwtag  DW_TAG_typedef
    3548                      .dwattr $C$DW$T$109, DW_AT_name("DRV_SPI_8305_Ctrl0B_t_")
    3549                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$89)
    3550                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   68

    3551              
    3552              
    3553              $C$DW$T$94      .dwtag  DW_TAG_structure_type
    3554                      .dwattr $C$DW$T$94, DW_AT_name("_DRV_SPI_8305_Ctrl0C_t_")
    3555                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x05)
    3556              $C$DW$528       .dwtag  DW_TAG_member
    3557                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$91)
    3558                      .dwattr $C$DW$528, DW_AT_name("VDS_MODE")
    3559                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_VDS_MODE")
    3560                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3561                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    3562              
    3563              $C$DW$529       .dwtag  DW_TAG_member
    3564                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$93)
    3565                      .dwattr $C$DW$529, DW_AT_name("VDS_LEVEL")
    3566                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_VDS_LEVEL")
    3567                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3568                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    3569              
    3570              $C$DW$530       .dwtag  DW_TAG_member
    3571                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$43)
    3572                      .dwattr $C$DW$530, DW_AT_name("CTRL0C_RSV1")
    3573                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_CTRL0C_RSV1")
    3574                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3575                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    3576              
    3577              $C$DW$531       .dwtag  DW_TAG_member
    3578                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$43)
    3579                      .dwattr $C$DW$531, DW_AT_name("CTRL0C_RSV2")
    3580                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_CTRL0C_RSV2")
    3581                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3582                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    3583              
    3584              $C$DW$532       .dwtag  DW_TAG_member
    3585                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$43)
    3586                      .dwattr $C$DW$532, DW_AT_name("CTRL0C_RSV3")
    3587                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_CTRL0C_RSV3")
    3588                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3589                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    3590              
    3591                      .dwendtag $C$DW$T$94
    3592              
    3593              $C$DW$T$110     .dwtag  DW_TAG_typedef
    3594                      .dwattr $C$DW$T$110, DW_AT_name("DRV_SPI_8305_Ctrl0C_t_")
    3595                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$94)
    3596                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3597              
    3598              
    3599              $C$DW$T$95      .dwtag  DW_TAG_structure_type
    3600                      .dwattr $C$DW$T$95, DW_AT_name("_DRV_SPI_8305_Stat01_t_")
    3601                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x0b)
    3602              $C$DW$533       .dwtag  DW_TAG_member
    3603                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$43)
    3604                      .dwattr $C$DW$533, DW_AT_name("OTW")
    3605                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_OTW")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   69

    3606                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3607                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    3608              
    3609              $C$DW$534       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$43)
    3611                      .dwattr $C$DW$534, DW_AT_name("TEMP_FLAG3")
    3612                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_TEMP_FLAG3")
    3613                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3614                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    3615              
    3616              $C$DW$535       .dwtag  DW_TAG_member
    3617                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$43)
    3618                      .dwattr $C$DW$535, DW_AT_name("TEMP_FLAG2")
    3619                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_TEMP_FLAG2")
    3620                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3621                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    3622              
    3623              $C$DW$536       .dwtag  DW_TAG_member
    3624                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$43)
    3625                      .dwattr $C$DW$536, DW_AT_name("TEMP_FLAG1")
    3626                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_TEMP_FLAG1")
    3627                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3628                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    3629              
    3630              $C$DW$537       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$43)
    3632                      .dwattr $C$DW$537, DW_AT_name("VCPH_UVFL")
    3633                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_VCPH_UVFL")
    3634                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3635                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    3636              
    3637              $C$DW$538       .dwtag  DW_TAG_member
    3638                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$43)
    3639                      .dwattr $C$DW$538, DW_AT_name("VDS_STATUS")
    3640                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_VDS_STATUS")
    3641                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3642                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    3643              
    3644              $C$DW$539       .dwtag  DW_TAG_member
    3645                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$43)
    3646                      .dwattr $C$DW$539, DW_AT_name("PVDD_OVFL")
    3647                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_PVDD_OVFL")
    3648                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3649                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    3650              
    3651              $C$DW$540       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$43)
    3653                      .dwattr $C$DW$540, DW_AT_name("PVDD_UVFL")
    3654                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_PVDD_UVFL")
    3655                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3656                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    3657              
    3658              $C$DW$541       .dwtag  DW_TAG_member
    3659                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$43)
    3660                      .dwattr $C$DW$541, DW_AT_name("TEMP_FLAG4")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   70

    3661                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_TEMP_FLAG4")
    3662                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3663                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    3664              
    3665              $C$DW$542       .dwtag  DW_TAG_member
    3666                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$43)
    3667                      .dwattr $C$DW$542, DW_AT_name("STAT01_RSV1")
    3668                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_STAT01_RSV1")
    3669                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3670                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    3671              
    3672              $C$DW$543       .dwtag  DW_TAG_member
    3673                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$43)
    3674                      .dwattr $C$DW$543, DW_AT_name("FAULT")
    3675                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_FAULT")
    3676                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3677                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    3678              
    3679                      .dwendtag $C$DW$T$95
    3680              
    3681              $C$DW$T$99      .dwtag  DW_TAG_typedef
    3682                      .dwattr $C$DW$T$99, DW_AT_name("DRV_SPI_8305_Stat01_t_")
    3683                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$95)
    3684                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    3685              
    3686              
    3687              $C$DW$T$96      .dwtag  DW_TAG_structure_type
    3688                      .dwattr $C$DW$T$96, DW_AT_name("_DRV_SPI_8305_Stat02_t_")
    3689                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x0b)
    3690              $C$DW$544       .dwtag  DW_TAG_member
    3691                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$43)
    3692                      .dwattr $C$DW$544, DW_AT_name("SNS_A_OCP")
    3693                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_SNS_A_OCP")
    3694                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3695                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    3696              
    3697              $C$DW$545       .dwtag  DW_TAG_member
    3698                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$43)
    3699                      .dwattr $C$DW$545, DW_AT_name("SNS_B_OCP")
    3700                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_SNS_B_OCP")
    3701                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3702                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    3703              
    3704              $C$DW$546       .dwtag  DW_TAG_member
    3705                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$43)
    3706                      .dwattr $C$DW$546, DW_AT_name("SNS_C_OCP")
    3707                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_SNS_C_OCP")
    3708                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3709                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    3710              
    3711              $C$DW$547       .dwtag  DW_TAG_member
    3712                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$43)
    3713                      .dwattr $C$DW$547, DW_AT_name("STAT02_RSV2")
    3714                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_STAT02_RSV2")
    3715                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   71

    3716                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3717              
    3718              $C$DW$548       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$43)
    3720                      .dwattr $C$DW$548, DW_AT_name("STAT02_RSV1")
    3721                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_STAT02_RSV1")
    3722                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3723                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    3724              
    3725              $C$DW$549       .dwtag  DW_TAG_member
    3726                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$43)
    3727                      .dwattr $C$DW$549, DW_AT_name("FETLC_VDS")
    3728                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_FETLC_VDS")
    3729                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3730                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3731              
    3732              $C$DW$550       .dwtag  DW_TAG_member
    3733                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$43)
    3734                      .dwattr $C$DW$550, DW_AT_name("FETHC_VDS")
    3735                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_FETHC_VDS")
    3736                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3737                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3738              
    3739              $C$DW$551       .dwtag  DW_TAG_member
    3740                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$43)
    3741                      .dwattr $C$DW$551, DW_AT_name("FETLB_VDS")
    3742                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_FETLB_VDS")
    3743                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3744                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3745              
    3746              $C$DW$552       .dwtag  DW_TAG_member
    3747                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$43)
    3748                      .dwattr $C$DW$552, DW_AT_name("FETHB_VDS")
    3749                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_FETHB_VDS")
    3750                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3751                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3752              
    3753              $C$DW$553       .dwtag  DW_TAG_member
    3754                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$43)
    3755                      .dwattr $C$DW$553, DW_AT_name("FETLA_VDS")
    3756                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_FETLA_VDS")
    3757                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3758                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3759              
    3760              $C$DW$554       .dwtag  DW_TAG_member
    3761                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$43)
    3762                      .dwattr $C$DW$554, DW_AT_name("FETHA_VDS")
    3763                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_FETHA_VDS")
    3764                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3765                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3766              
    3767                      .dwendtag $C$DW$T$96
    3768              
    3769              $C$DW$T$100     .dwtag  DW_TAG_typedef
    3770                      .dwattr $C$DW$T$100, DW_AT_name("DRV_SPI_8305_Stat02_t_")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   72

    3771                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$96)
    3772                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    3773              
    3774              
    3775              $C$DW$T$97      .dwtag  DW_TAG_structure_type
    3776                      .dwattr $C$DW$T$97, DW_AT_name("_DRV_SPI_8305_Stat03_t_")
    3777                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x0b)
    3778              $C$DW$555       .dwtag  DW_TAG_member
    3779                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$43)
    3780                      .dwattr $C$DW$555, DW_AT_name("VCPH_OVLO_ABS")
    3781                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_VCPH_OVLO_ABS")
    3782                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3783                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3784              
    3785              $C$DW$556       .dwtag  DW_TAG_member
    3786                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$43)
    3787                      .dwattr $C$DW$556, DW_AT_name("VCPH_OVLO")
    3788                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_VCPH_OVLO")
    3789                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3790                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3791              
    3792              $C$DW$557       .dwtag  DW_TAG_member
    3793                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$43)
    3794                      .dwattr $C$DW$557, DW_AT_name("VCPH_UVLO2")
    3795                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_VCPH_UVLO2")
    3796                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3797                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3798              
    3799              $C$DW$558       .dwtag  DW_TAG_member
    3800                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$43)
    3801                      .dwattr $C$DW$558, DW_AT_name("STAT03_RSV2")
    3802                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_STAT03_RSV2")
    3803                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3804                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3805              
    3806              $C$DW$559       .dwtag  DW_TAG_member
    3807                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$43)
    3808                      .dwattr $C$DW$559, DW_AT_name("VCP_LSD_UVLO2")
    3809                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_VCP_LSD_UVLO2")
    3810                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3811                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3812              
    3813              $C$DW$560       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$43)
    3815                      .dwattr $C$DW$560, DW_AT_name("AVDD_UVLO")
    3816                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_AVDD_UVLO")
    3817                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3818                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3819              
    3820              $C$DW$561       .dwtag  DW_TAG_member
    3821                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$43)
    3822                      .dwattr $C$DW$561, DW_AT_name("VREG_UV")
    3823                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_VREG_UV")
    3824                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3825                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   73

    3826              
    3827              $C$DW$562       .dwtag  DW_TAG_member
    3828                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$43)
    3829                      .dwattr $C$DW$562, DW_AT_name("STAT03_RSV1")
    3830                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_STAT03_RSV1")
    3831                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3832                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3833              
    3834              $C$DW$563       .dwtag  DW_TAG_member
    3835                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$43)
    3836                      .dwattr $C$DW$563, DW_AT_name("OTS")
    3837                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_OTS")
    3838                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3839                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3840              
    3841              $C$DW$564       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$43)
    3843                      .dwattr $C$DW$564, DW_AT_name("WD_FAULT")
    3844                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_WD_FAULT")
    3845                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3846                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3847              
    3848              $C$DW$565       .dwtag  DW_TAG_member
    3849                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$43)
    3850                      .dwattr $C$DW$565, DW_AT_name("PVDD_UVLO2")
    3851                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_PVDD_UVLO2")
    3852                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3853                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3854              
    3855                      .dwendtag $C$DW$T$97
    3856              
    3857              $C$DW$T$101     .dwtag  DW_TAG_typedef
    3858                      .dwattr $C$DW$T$101, DW_AT_name("DRV_SPI_8305_Stat03_t_")
    3859                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$97)
    3860                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    3861              
    3862              
    3863              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    3864                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8305_Stat04_t_")
    3865                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x0b)
    3866              $C$DW$566       .dwtag  DW_TAG_member
    3867                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$43)
    3868                      .dwattr $C$DW$566, DW_AT_name("STAT04_RSV5")
    3869                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_STAT04_RSV5")
    3870                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3871                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3872              
    3873              $C$DW$567       .dwtag  DW_TAG_member
    3874                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$43)
    3875                      .dwattr $C$DW$567, DW_AT_name("STAT04_RSV4")
    3876                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_STAT04_RSV4")
    3877                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3878                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3879              
    3880              $C$DW$568       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   74

    3881                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$43)
    3882                      .dwattr $C$DW$568, DW_AT_name("STAT04_RSV3")
    3883                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_STAT04_RSV3")
    3884                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3885                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3886              
    3887              $C$DW$569       .dwtag  DW_TAG_member
    3888                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$43)
    3889                      .dwattr $C$DW$569, DW_AT_name("STAT04_RSV2")
    3890                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_STAT04_RSV2")
    3891                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3892                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3893              
    3894              $C$DW$570       .dwtag  DW_TAG_member
    3895                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$43)
    3896                      .dwattr $C$DW$570, DW_AT_name("STAT04_RSV1")
    3897                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_STAT04_RSV1")
    3898                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3899                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3900              
    3901              $C$DW$571       .dwtag  DW_TAG_member
    3902                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$43)
    3903                      .dwattr $C$DW$571, DW_AT_name("FETLC_VGS")
    3904                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_FETLC_VGS")
    3905                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3906                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3907              
    3908              $C$DW$572       .dwtag  DW_TAG_member
    3909                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$43)
    3910                      .dwattr $C$DW$572, DW_AT_name("FETHC_VGS")
    3911                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_FETHC_VGS")
    3912                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3913                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3914              
    3915              $C$DW$573       .dwtag  DW_TAG_member
    3916                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$43)
    3917                      .dwattr $C$DW$573, DW_AT_name("FETLB_VGS")
    3918                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_FETLB_VGS")
    3919                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3920                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3921              
    3922              $C$DW$574       .dwtag  DW_TAG_member
    3923                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$43)
    3924                      .dwattr $C$DW$574, DW_AT_name("FETHB_VGS")
    3925                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_FETHB_VGS")
    3926                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3927                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3928              
    3929              $C$DW$575       .dwtag  DW_TAG_member
    3930                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$43)
    3931                      .dwattr $C$DW$575, DW_AT_name("FETLA_VGS")
    3932                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_FETLA_VGS")
    3933                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3934                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3935              
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   75

    3936              $C$DW$576       .dwtag  DW_TAG_member
    3937                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$43)
    3938                      .dwattr $C$DW$576, DW_AT_name("FETHA_VGS")
    3939                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_FETHA_VGS")
    3940                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3941                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3942              
    3943                      .dwendtag $C$DW$T$98
    3944              
    3945              $C$DW$T$102     .dwtag  DW_TAG_typedef
    3946                      .dwattr $C$DW$T$102, DW_AT_name("DRV_SPI_8305_Stat04_t_")
    3947                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$98)
    3948                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    3949              
    3950              
    3951              $C$DW$T$111     .dwtag  DW_TAG_structure_type
    3952                      .dwattr $C$DW$T$111, DW_AT_name("_DRV_SPI_8305_Vars_t_")
    3953                      .dwattr $C$DW$T$111, DW_AT_byte_size(0x61)
    3954              $C$DW$577       .dwtag  DW_TAG_member
    3955                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$99)
    3956                      .dwattr $C$DW$577, DW_AT_name("Stat_Reg_01")
    3957                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_Stat_Reg_01")
    3958                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3959                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3960              
    3961              $C$DW$578       .dwtag  DW_TAG_member
    3962                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$100)
    3963                      .dwattr $C$DW$578, DW_AT_name("Stat_Reg_02")
    3964                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_Stat_Reg_02")
    3965                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3966                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3967              
    3968              $C$DW$579       .dwtag  DW_TAG_member
    3969                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$101)
    3970                      .dwattr $C$DW$579, DW_AT_name("Stat_Reg_03")
    3971                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_Stat_Reg_03")
    3972                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3973                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3974              
    3975              $C$DW$580       .dwtag  DW_TAG_member
    3976                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$102)
    3977                      .dwattr $C$DW$580, DW_AT_name("Stat_Reg_04")
    3978                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_Stat_Reg_04")
    3979                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3980                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3981              
    3982              $C$DW$581       .dwtag  DW_TAG_member
    3983                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$103)
    3984                      .dwattr $C$DW$581, DW_AT_name("Ctrl_Reg_05")
    3985                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_Ctrl_Reg_05")
    3986                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3987                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3988              
    3989              $C$DW$582       .dwtag  DW_TAG_member
    3990                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$104)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 18:41:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0232410                         PAGE   76

    3991                      .dwattr $C$DW$582, DW_AT_name("Ctrl_Reg_06")
    3992                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_Ctrl_Reg_06")
    3993                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3994                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3995              
    3996              $C$DW$583       .dwtag  DW_TAG_member
    3997                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$105)
    3998                      .dwattr $C$DW$583, DW_AT_name("Ctrl_Reg_07")
    3999                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_Ctrl_Reg_07")
    4000                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4001                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    4002              
    4003              $C$DW$584       .dwtag  DW_TAG_member
    4004                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$106)
    4005                      .dwattr $C$DW$584, DW_AT_name("Ctrl_Reg_08")
    4006                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_Ctrl_Reg_08")
    4007                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4008                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    4009              
    4010              $C$DW$585       .dwtag  DW_TAG_member
    4011                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$107)
    4012                      .dwattr $C$DW$585, DW_AT_name("Ctrl_Reg_09")
    4013                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_Ctrl_Reg_09")
