TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                    PC v16.9.1.LTS *
       3              ;* Date/Time created: Wed Jan 04 15:50:44 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_17/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v16.9.1.LTS Copyright (c) 1996-2015
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_17\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("CTRL_setGains")

    3336              $C$DW$332       .dwtag  DW_TAG_enumerator
    3337                      .dwattr $C$DW$332, DW_AT_name("USER_ErrorCode_estFreq_Hz_High")
    3338                      .dwattr $C$DW$332, DW_AT_const_value(0x60)
    3339              
    3340              $C$DW$333       .dwtag  DW_TAG_enumerator
    3341                      .dwattr $C$DW$333, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low")
    3342                      .dwattr $C$DW$333, DW_AT_const_value(0x61)
    3343              
    3344              $C$DW$334       .dwtag  DW_TAG_enumerator
    3345                      .dwattr $C$DW$334, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High")
    3346                      .dwattr $C$DW$334, DW_AT_const_value(0x62)
    3347              
    3348              $C$DW$335       .dwtag  DW_TAG_enumerator
    3349                      .dwattr $C$DW$335, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low")
    3350                      .dwattr $C$DW$335, DW_AT_const_value(0x63)
    3351              
    3352              $C$DW$336       .dwtag  DW_TAG_enumerator
    3353                      .dwattr $C$DW$336, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High")
    3354                      .dwattr $C$DW$336, DW_AT_const_value(0x64)
    3355              
    3356              $C$DW$337       .dwtag  DW_TAG_enumerator
    3357                      .dwattr $C$DW$337, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low")
    3358                      .dwattr $C$DW$337, DW_AT_const_value(0x65)
    3359              
    3360              $C$DW$338       .dwtag  DW_TAG_enumerator
    3361                      .dwattr $C$DW$338, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    3362                      .dwattr $C$DW$338, DW_AT_const_value(0x66)
    3363              
    3364              $C$DW$339       .dwtag  DW_TAG_enumerator
    3365                      .dwattr $C$DW$339, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    3366                      .dwattr $C$DW$339, DW_AT_const_value(0x67)
    3367              
    3368              $C$DW$340       .dwtag  DW_TAG_enumerator
    3369                      .dwattr $C$DW$340, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    3370                      .dwattr $C$DW$340, DW_AT_const_value(0x68)
    3371              
    3372              $C$DW$341       .dwtag  DW_TAG_enumerator
    3373                      .dwattr $C$DW$341, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
    3374                      .dwattr $C$DW$341, DW_AT_const_value(0x69)
    3375              
    3376              $C$DW$342       .dwtag  DW_TAG_enumerator
    3377                      .dwattr $C$DW$342, DW_AT_name("USER_numErrorCodes")
    3378                      .dwattr $C$DW$342, DW_AT_const_value(0x6a)
    3379              
    3380                      .dwendtag $C$DW$T$74
    3381              
    3382              $C$DW$T$75      .dwtag  DW_TAG_typedef
    3383                      .dwattr $C$DW$T$75, DW_AT_name("USER_ErrorCode_e")
    3384                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   67

    3385                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3386              
    3387              $C$DW$343       .dwtag  DW_TAG_TI_far_type
    3388                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$75)
    3389              
    3390              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3391                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$343)
    3392              
    3393              
    3394              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    3395                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    3396              $C$DW$344       .dwtag  DW_TAG_enumerator
    3397                      .dwattr $C$DW$344, DW_AT_name("CTRL_Type_PID_spd")
    3398                      .dwattr $C$DW$344, DW_AT_const_value(0x00)
    3399              
    3400              $C$DW$345       .dwtag  DW_TAG_enumerator
    3401                      .dwattr $C$DW$345, DW_AT_name("CTRL_Type_PID_Id")
    3402                      .dwattr $C$DW$345, DW_AT_const_value(0x01)
    3403              
    3404              $C$DW$346       .dwtag  DW_TAG_enumerator
    3405                      .dwattr $C$DW$346, DW_AT_name("CTRL_Type_PID_Iq")
    3406                      .dwattr $C$DW$346, DW_AT_const_value(0x02)
    3407              
    3408                      .dwendtag $C$DW$T$82
    3409              
    3410              $C$DW$T$83      .dwtag  DW_TAG_typedef
    3411                      .dwattr $C$DW$T$83, DW_AT_name("CTRL_Type_e")
    3412                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3413                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3414              
    3415              $C$DW$347       .dwtag  DW_TAG_TI_far_type
    3416                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$83)
    3417              
    3418              $C$DW$T$84      .dwtag  DW_TAG_const_type
    3419                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$347)
    3420              
    3421              
    3422              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3423                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    3424                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    3425              $C$DW$348       .dwtag  DW_TAG_member
    3426                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    3427                      .dwattr $C$DW$348, DW_AT_name("alpha_sf")
    3428                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_alpha_sf")
    3429                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3430                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3431              
    3432              $C$DW$349       .dwtag  DW_TAG_member
    3433                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    3434                      .dwattr $C$DW$349, DW_AT_name("beta_sf")
    3435                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_beta_sf")
    3436                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3437                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3438              
    3439              $C$DW$350       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   68

    3440                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$22)
    3441                      .dwattr $C$DW$350, DW_AT_name("numSensors")
    3442                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_numSensors")
    3443                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3444                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3445              
    3446                      .dwendtag $C$DW$T$23
    3447              
    3448              $C$DW$T$31      .dwtag  DW_TAG_typedef
    3449                      .dwattr $C$DW$T$31, DW_AT_name("CLARKE_Obj")
    3450                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    3451                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3452              
    3453              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3454                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    3455                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3456              
    3457              $C$DW$T$30      .dwtag  DW_TAG_typedef
    3458                      .dwattr $C$DW$T$30, DW_AT_name("CLARKE_Handle")
    3459                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3460                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3461              
    3462              
    3463              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3464                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    3465                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    3466              $C$DW$351       .dwtag  DW_TAG_member
    3467                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$24)
    3468                      .dwattr $C$DW$351, DW_AT_name("version")
    3469                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_version")
    3470                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3471                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3472              
    3473              $C$DW$352       .dwtag  DW_TAG_member
    3474                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$26)
    3475                      .dwattr $C$DW$352, DW_AT_name("state")
    3476                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_state")
    3477                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3478                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3479              
    3480              $C$DW$353       .dwtag  DW_TAG_member
    3481                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$26)
    3482                      .dwattr $C$DW$353, DW_AT_name("prevState")
    3483                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_prevState")
    3484                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3485                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3486              
    3487              $C$DW$354       .dwtag  DW_TAG_member
    3488                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$28)
    3489                      .dwattr $C$DW$354, DW_AT_name("errorCode")
    3490                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_errorCode")
    3491                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3492                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3493              
    3494              $C$DW$355       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   69

    3495                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$30)
    3496                      .dwattr $C$DW$355, DW_AT_name("clarkeHandle_I")
    3497                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3498                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3499                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3500              
    3501              $C$DW$356       .dwtag  DW_TAG_member
    3502                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$31)
    3503                      .dwattr $C$DW$356, DW_AT_name("clarke_I")
    3504                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_clarke_I")
    3505                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3506                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3507              
    3508              $C$DW$357       .dwtag  DW_TAG_member
    3509                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$30)
    3510                      .dwattr $C$DW$357, DW_AT_name("clarkeHandle_V")
    3511                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3512                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3513                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3514              
    3515              $C$DW$358       .dwtag  DW_TAG_member
    3516                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$31)
    3517                      .dwattr $C$DW$358, DW_AT_name("clarke_V")
    3518                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_clarke_V")
    3519                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3520                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3521              
    3522              $C$DW$359       .dwtag  DW_TAG_member
    3523                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$33)
    3524                      .dwattr $C$DW$359, DW_AT_name("estHandle")
    3525                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_estHandle")
    3526                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3527                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3528              
    3529              $C$DW$360       .dwtag  DW_TAG_member
    3530                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$35)
    3531                      .dwattr $C$DW$360, DW_AT_name("parkHandle")
    3532                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_parkHandle")
    3533                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3534                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3535              
    3536              $C$DW$361       .dwtag  DW_TAG_member
    3537                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$36)
    3538                      .dwattr $C$DW$361, DW_AT_name("park")
    3539                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_park")
    3540                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3541                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3542              
    3543              $C$DW$362       .dwtag  DW_TAG_member
    3544                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$38)
    3545                      .dwattr $C$DW$362, DW_AT_name("pidHandle_Id")
    3546                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_pidHandle_Id")
    3547                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3548                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3549              
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   70

    3550              $C$DW$363       .dwtag  DW_TAG_member
    3551                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$39)
    3552                      .dwattr $C$DW$363, DW_AT_name("pid_Id")
    3553                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_pid_Id")
    3554                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3555                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3556              
    3557              $C$DW$364       .dwtag  DW_TAG_member
    3558                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$38)
    3559                      .dwattr $C$DW$364, DW_AT_name("pidHandle_Iq")
    3560                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3561                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3562                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3563              
    3564              $C$DW$365       .dwtag  DW_TAG_member
    3565                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$39)
    3566                      .dwattr $C$DW$365, DW_AT_name("pid_Iq")
    3567                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_pid_Iq")
    3568                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3569                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3570              
    3571              $C$DW$366       .dwtag  DW_TAG_member
    3572                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$38)
    3573                      .dwattr $C$DW$366, DW_AT_name("pidHandle_spd")
    3574                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_pidHandle_spd")
    3575                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3576                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3577              
    3578              $C$DW$367       .dwtag  DW_TAG_member
    3579                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$39)
    3580                      .dwattr $C$DW$367, DW_AT_name("pid_spd")
    3581                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_pid_spd")
    3582                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3583                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3584              
    3585              $C$DW$368       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$41)
    3587                      .dwattr $C$DW$368, DW_AT_name("iparkHandle")
    3588                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_iparkHandle")
    3589                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3590                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3591              
    3592              $C$DW$369       .dwtag  DW_TAG_member
    3593                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$42)
    3594                      .dwattr $C$DW$369, DW_AT_name("ipark")
    3595                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ipark")
    3596                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3597                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3598              
    3599              $C$DW$370       .dwtag  DW_TAG_member
    3600                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$44)
    3601                      .dwattr $C$DW$370, DW_AT_name("svgenHandle")
    3602                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_svgenHandle")
    3603                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3604                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   71

    3605              
    3606              $C$DW$371       .dwtag  DW_TAG_member
    3607                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$45)
    3608                      .dwattr $C$DW$371, DW_AT_name("svgen")
    3609                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_svgen")
    3610                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3611                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3612              
    3613              $C$DW$372       .dwtag  DW_TAG_member
    3614                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$47)
    3615                      .dwattr $C$DW$372, DW_AT_name("trajHandle_Id")
    3616                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_trajHandle_Id")
    3617                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3618                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3619              
    3620              $C$DW$373       .dwtag  DW_TAG_member
    3621                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$48)
    3622                      .dwattr $C$DW$373, DW_AT_name("traj_Id")
    3623                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_traj_Id")
    3624                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3625                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3626              
    3627              $C$DW$374       .dwtag  DW_TAG_member
    3628                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$47)
    3629                      .dwattr $C$DW$374, DW_AT_name("trajHandle_spd")
    3630                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_trajHandle_spd")
    3631                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3632                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3633              
    3634              $C$DW$375       .dwtag  DW_TAG_member
    3635                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$48)
    3636                      .dwattr $C$DW$375, DW_AT_name("traj_spd")
    3637                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_traj_spd")
    3638                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3639                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3640              
    3641              $C$DW$376       .dwtag  DW_TAG_member
    3642                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$47)
    3643                      .dwattr $C$DW$376, DW_AT_name("trajHandle_spdMax")
    3644                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3645                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3646                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3647              
    3648              $C$DW$377       .dwtag  DW_TAG_member
    3649                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$48)
    3650                      .dwattr $C$DW$377, DW_AT_name("traj_spdMax")
    3651                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_traj_spdMax")
    3652                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3653                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3654              
    3655              $C$DW$378       .dwtag  DW_TAG_member
    3656                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$49)
    3657                      .dwattr $C$DW$378, DW_AT_name("motorParams")
    3658                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_motorParams")
    3659                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   72

    3660                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3661              
    3662              $C$DW$379       .dwtag  DW_TAG_member
    3663                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$52)
    3664                      .dwattr $C$DW$379, DW_AT_name("waitTimes")
    3665                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_waitTimes")
    3666                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3667                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3668              
    3669              $C$DW$380       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$51)
    3671                      .dwattr $C$DW$380, DW_AT_name("counter_state")
    3672                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_counter_state")
    3673                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3674                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3675              
    3676              $C$DW$381       .dwtag  DW_TAG_member
    3677                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$53)
    3678                      .dwattr $C$DW$381, DW_AT_name("numIsrTicksPerCtrlTick")
    3679                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3680                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3681                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3682              
    3683              $C$DW$382       .dwtag  DW_TAG_member
    3684                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$53)
    3685                      .dwattr $C$DW$382, DW_AT_name("numCtrlTicksPerCurrentTick")
    3686                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3687                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3688                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3689              
    3690              $C$DW$383       .dwtag  DW_TAG_member
    3691                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$53)
    3692                      .dwattr $C$DW$383, DW_AT_name("numCtrlTicksPerSpeedTick")
    3693                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3694                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3695                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3696              
    3697              $C$DW$384       .dwtag  DW_TAG_member
    3698                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$53)
    3699                      .dwattr $C$DW$384, DW_AT_name("numCtrlTicksPerTrajTick")
    3700                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3701                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3702                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3703              
    3704              $C$DW$385       .dwtag  DW_TAG_member
    3705                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$51)
    3706                      .dwattr $C$DW$385, DW_AT_name("ctrlFreq_Hz")
    3707                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3708                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3709                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3710              
    3711              $C$DW$386       .dwtag  DW_TAG_member
    3712                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$51)
    3713                      .dwattr $C$DW$386, DW_AT_name("trajFreq_Hz")
    3714                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_trajFreq_Hz")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   73

    3715                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3716                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3717              
    3718              $C$DW$387       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
    3720                      .dwattr $C$DW$387, DW_AT_name("trajPeriod_sec")
    3721                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3722                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3723                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3724              
    3725              $C$DW$388       .dwtag  DW_TAG_member
    3726                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$54)
    3727                      .dwattr $C$DW$388, DW_AT_name("ctrlPeriod_sec")
    3728                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3729                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3730                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3731              
    3732              $C$DW$389       .dwtag  DW_TAG_member
    3733                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
    3734                      .dwattr $C$DW$389, DW_AT_name("maxVsMag_pu")
    3735                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3736                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3737                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3738              
    3739              $C$DW$390       .dwtag  DW_TAG_member
    3740                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$55)
    3741                      .dwattr $C$DW$390, DW_AT_name("Iab_in")
    3742                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_Iab_in")
    3743                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3744                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3745              
    3746              $C$DW$391       .dwtag  DW_TAG_member
    3747                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$55)
    3748                      .dwattr $C$DW$391, DW_AT_name("Iab_filt")
    3749                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_Iab_filt")
    3750                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3751                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3752              
    3753              $C$DW$392       .dwtag  DW_TAG_member
    3754                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$55)
    3755                      .dwattr $C$DW$392, DW_AT_name("Idq_in")
    3756                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_Idq_in")
    3757                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3758                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3759              
    3760              $C$DW$393       .dwtag  DW_TAG_member
    3761                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$55)
    3762                      .dwattr $C$DW$393, DW_AT_name("Vab_in")
    3763                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_Vab_in")
    3764                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3765                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3766              
    3767              $C$DW$394       .dwtag  DW_TAG_member
    3768                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    3769                      .dwattr $C$DW$394, DW_AT_name("spd_out")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   74

    3770                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_spd_out")
    3771                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3772                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3773              
    3774              $C$DW$395       .dwtag  DW_TAG_member
    3775                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$55)
    3776                      .dwattr $C$DW$395, DW_AT_name("Vab_out")
    3777                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_Vab_out")
    3778                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3779                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3780              
    3781              $C$DW$396       .dwtag  DW_TAG_member
    3782                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$55)
    3783                      .dwattr $C$DW$396, DW_AT_name("Vdq_out")
    3784                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_Vdq_out")
    3785                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3786                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3787              
    3788              $C$DW$397       .dwtag  DW_TAG_member
    3789                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$54)
    3790                      .dwattr $C$DW$397, DW_AT_name("Rhf")
    3791                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_Rhf")
    3792                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3793                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3794              
    3795              $C$DW$398       .dwtag  DW_TAG_member
    3796                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$54)
    3797                      .dwattr $C$DW$398, DW_AT_name("Lhf")
    3798                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Lhf")
    3799                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3800                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3801              
    3802              $C$DW$399       .dwtag  DW_TAG_member
    3803                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$54)
    3804                      .dwattr $C$DW$399, DW_AT_name("RoverL")
    3805                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_RoverL")
    3806                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3807                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3808              
    3809              $C$DW$400       .dwtag  DW_TAG_member
    3810                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    3811                      .dwattr $C$DW$400, DW_AT_name("Kp_Id")
    3812                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Kp_Id")
    3813                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3814                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3815              
    3816              $C$DW$401       .dwtag  DW_TAG_member
    3817                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    3818                      .dwattr $C$DW$401, DW_AT_name("Kp_Iq")
    3819                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_Kp_Iq")
    3820                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3821                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3822              
    3823              $C$DW$402       .dwtag  DW_TAG_member
    3824                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   75

    3825                      .dwattr $C$DW$402, DW_AT_name("Kp_spd")
    3826                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_Kp_spd")
    3827                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3828                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3829              
    3830              $C$DW$403       .dwtag  DW_TAG_member
    3831                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    3832                      .dwattr $C$DW$403, DW_AT_name("Ki_Id")
    3833                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_Ki_Id")
    3834                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3835                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3836              
    3837              $C$DW$404       .dwtag  DW_TAG_member
    3838                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    3839                      .dwattr $C$DW$404, DW_AT_name("Ki_Iq")
    3840                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_Ki_Iq")
    3841                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3842                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3843              
    3844              $C$DW$405       .dwtag  DW_TAG_member
    3845                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3846                      .dwattr $C$DW$405, DW_AT_name("Ki_spd")
    3847                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Ki_spd")
    3848                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3849                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3850              
    3851              $C$DW$406       .dwtag  DW_TAG_member
    3852                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    3853                      .dwattr $C$DW$406, DW_AT_name("Kd_Id")
    3854                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_Kd_Id")
    3855                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3856                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3857              
    3858              $C$DW$407       .dwtag  DW_TAG_member
    3859                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3860                      .dwattr $C$DW$407, DW_AT_name("Kd_Iq")
    3861                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Kd_Iq")
    3862                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3863                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3864              
    3865              $C$DW$408       .dwtag  DW_TAG_member
    3866                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    3867                      .dwattr $C$DW$408, DW_AT_name("Kd_spd")
    3868                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Kd_spd")
    3869                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3870                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3871              
    3872              $C$DW$409       .dwtag  DW_TAG_member
    3873                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    3874                      .dwattr $C$DW$409, DW_AT_name("Ui_Id")
    3875                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Ui_Id")
    3876                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3877                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3878              
    3879              $C$DW$410       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   76

    3880                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3881                      .dwattr $C$DW$410, DW_AT_name("Ui_Iq")
    3882                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Ui_Iq")
    3883                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3884                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3885              
    3886              $C$DW$411       .dwtag  DW_TAG_member
    3887                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3888                      .dwattr $C$DW$411, DW_AT_name("Ui_spd")
    3889                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Ui_spd")
    3890                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3891                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3892              
    3893              $C$DW$412       .dwtag  DW_TAG_member
    3894                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$55)
    3895                      .dwattr $C$DW$412, DW_AT_name("Idq_ref")
    3896                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Idq_ref")
    3897                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3898                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3899              
    3900              $C$DW$413       .dwtag  DW_TAG_member
    3901                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
    3902                      .dwattr $C$DW$413, DW_AT_name("IdRated")
    3903                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_IdRated")
    3904                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3905                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3906              
    3907              $C$DW$414       .dwtag  DW_TAG_member
    3908                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    3909                      .dwattr $C$DW$414, DW_AT_name("spd_ref")
    3910                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_spd_ref")
    3911                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3912                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3913              
    3914              $C$DW$415       .dwtag  DW_TAG_member
    3915                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    3916                      .dwattr $C$DW$415, DW_AT_name("spd_max")
    3917                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_spd_max")
    3918                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3919                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3920              
    3921              $C$DW$416       .dwtag  DW_TAG_member
    3922                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$53)
    3923                      .dwattr $C$DW$416, DW_AT_name("counter_current")
    3924                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_counter_current")
    3925                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3926                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3927              
    3928              $C$DW$417       .dwtag  DW_TAG_member
    3929                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$53)
    3930                      .dwattr $C$DW$417, DW_AT_name("counter_isr")
    3931                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_counter_isr")
    3932                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3933                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3934              
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   77

    3935              $C$DW$418       .dwtag  DW_TAG_member
    3936                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$53)
    3937                      .dwattr $C$DW$418, DW_AT_name("counter_speed")
    3938                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_counter_speed")
    3939                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3940                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3941              
    3942              $C$DW$419       .dwtag  DW_TAG_member
    3943                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$53)
    3944                      .dwattr $C$DW$419, DW_AT_name("counter_traj")
    3945                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_counter_traj")
    3946                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3947                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3948              
    3949              $C$DW$420       .dwtag  DW_TAG_member
    3950                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$56)
    3951                      .dwattr $C$DW$420, DW_AT_name("flag_enableCtrl")
    3952                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3953                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3954                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3955              
    3956              $C$DW$421       .dwtag  DW_TAG_member
    3957                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$56)
    3958                      .dwattr $C$DW$421, DW_AT_name("flag_enableDcBusComp")
    3959                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3960                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3961                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3962              
    3963              $C$DW$422       .dwtag  DW_TAG_member
    3964                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$56)
    3965                      .dwattr $C$DW$422, DW_AT_name("flag_enablePowerWarp")
    3966                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3967                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3968                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3969              
    3970              $C$DW$423       .dwtag  DW_TAG_member
    3971                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$56)
    3972                      .dwattr $C$DW$423, DW_AT_name("flag_enableOffset")
    3973                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_flag_enableOffset")
    3974                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3975                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3976              
    3977              $C$DW$424       .dwtag  DW_TAG_member
    3978                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$56)
    3979                      .dwattr $C$DW$424, DW_AT_name("flag_enableSpeedCtrl")
    3980                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3981                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3982                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3983              
    3984              $C$DW$425       .dwtag  DW_TAG_member
    3985                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$56)
    3986                      .dwattr $C$DW$425, DW_AT_name("flag_enableUserMotorParams")
    3987                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3988                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3989                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   78

    3990              
    3991              $C$DW$426       .dwtag  DW_TAG_member
    3992                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$55)
    3993                      .dwattr $C$DW$426, DW_AT_name("Idq_offset_pu")
    3994                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3995                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3996                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3997              
    3998              $C$DW$427       .dwtag  DW_TAG_member
    3999                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$55)
    4000                      .dwattr $C$DW$427, DW_AT_name("Vdq_offset_pu")
    4001                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4002                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4003                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4004              
    4005              $C$DW$428       .dwtag  DW_TAG_member
    4006                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    4007                      .dwattr $C$DW$428, DW_AT_name("angle_pu")
    4008                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_angle_pu")
    4009                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4010                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4011              
    4012              $C$DW$429       .dwtag  DW_TAG_member
    4013                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    4014                      .dwattr $C$DW$429, DW_AT_name("speed_ref_pu")
    4015                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_speed_ref_pu")
    4016                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4017                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4018              
    4019              $C$DW$430       .dwtag  DW_TAG_member
    4020                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    4021                      .dwattr $C$DW$430, DW_AT_name("speed_fb_pu")
    4022                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_speed_fb_pu")
    4023                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4024                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4025              
    4026              $C$DW$431       .dwtag  DW_TAG_member
    4027                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    4028                      .dwattr $C$DW$431, DW_AT_name("speed_outMax_pu")
    4029                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4030                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4031                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4032              
    4033              $C$DW$432       .dwtag  DW_TAG_member
    4034                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$56)
    4035                      .dwattr $C$DW$432, DW_AT_name("flag_enableCurrentCtrl")
    4036                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4037                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4038                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4039              
    4040                      .dwendtag $C$DW$T$57
    4041              
    4042              $C$DW$T$85      .dwtag  DW_TAG_typedef
    4043                      .dwattr $C$DW$T$85, DW_AT_name("CTRL_Obj")
    4044                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   79

    4045                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4046              
    4047              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    4048                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    4049                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    4050              
    4051              $C$DW$T$87      .dwtag  DW_TAG_typedef
    4052                      .dwattr $C$DW$T$87, DW_AT_name("CTRL_Handle")
    4053                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4054                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4055              
    4056              $C$DW$433       .dwtag  DW_TAG_TI_far_type
    4057                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$87)
    4058              
    4059              $C$DW$T$88      .dwtag  DW_TAG_const_type
    4060                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$433)
    4061              
    4062              
    4063              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4064                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    4065                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    4066              $C$DW$434       .dwtag  DW_TAG_member
    4067                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
    4068                      .dwattr $C$DW$434, DW_AT_name("rsvd")
    4069                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_rsvd")
    4070                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4071                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4072              
    4073              $C$DW$435       .dwtag  DW_TAG_member
    4074                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$59)
    4075                      .dwattr $C$DW$435, DW_AT_name("targetProc")
    4076                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_targetProc")
    4077                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4078                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4079              
    4080              $C$DW$436       .dwtag  DW_TAG_member
    4081                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$21)
    4082                      .dwattr $C$DW$436, DW_AT_name("major")
    4083                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_major")
    4084                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4085                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4086              
    4087              $C$DW$437       .dwtag  DW_TAG_member
    4088                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
    4089                      .dwattr $C$DW$437, DW_AT_name("minor")
    4090                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_minor")
    4091                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4092                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4093              
    4094                      .dwendtag $C$DW$T$60
    4095              
    4096              $C$DW$T$24      .dwtag  DW_TAG_typedef
    4097                      .dwattr $C$DW$T$24, DW_AT_name("CTRL_Version")
    4098                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    4099                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   80

    4100              
    4101              
    4102              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4103                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4104                      .dwattr $C$DW$T$19, DW_AT_declaration
    4105                      .dwendtag $C$DW$T$19
    4106              
    4107              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4108                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    4109                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    4110              
    4111              $C$DW$T$33      .dwtag  DW_TAG_typedef
    4112                      .dwattr $C$DW$T$33, DW_AT_name("EST_Handle")
    4113                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4114                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4115              
    4116              
    4117              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4118                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    4119                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    4120              $C$DW$438       .dwtag  DW_TAG_member
    4121                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    4122                      .dwattr $C$DW$438, DW_AT_name("sinTh")
    4123                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_sinTh")
    4124                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4125                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4126              
    4127              $C$DW$439       .dwtag  DW_TAG_member
    4128                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    4129                      .dwattr $C$DW$439, DW_AT_name("cosTh")
    4130                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_cosTh")
    4131                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4132                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4133              
    4134                      .dwendtag $C$DW$T$61
    4135              
    4136              $C$DW$T$42      .dwtag  DW_TAG_typedef
    4137                      .dwattr $C$DW$T$42, DW_AT_name("IPARK_Obj")
    4138                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    4139                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4140              
    4141              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4142                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    4143                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    4144              
    4145              $C$DW$T$41      .dwtag  DW_TAG_typedef
    4146                      .dwattr $C$DW$T$41, DW_AT_name("IPARK_Handle")
    4147                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    4148                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4149              
    4150              
    4151              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4152                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    4153                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    4154              $C$DW$440       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   81

    4155                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$62)
    4156                      .dwattr $C$DW$440, DW_AT_name("value")
    4157                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_value")
    4158                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4159                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4160              
    4161                      .dwendtag $C$DW$T$63
    4162              
    4163              $C$DW$T$55      .dwtag  DW_TAG_typedef
    4164                      .dwattr $C$DW$T$55, DW_AT_name("MATH_vec2")
    4165                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    4166                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4167              
    4168              
    4169              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4170                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    4171                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    4172              $C$DW$441       .dwtag  DW_TAG_member
    4173                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$65)
    4174                      .dwattr $C$DW$441, DW_AT_name("type")
    4175                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_type")
    4176                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4177                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4178              
    4179              $C$DW$442       .dwtag  DW_TAG_member
    4180                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$53)
    4181                      .dwattr $C$DW$442, DW_AT_name("numPolePairs")
    4182                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_numPolePairs")
    4183                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4184                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4185              
    4186              $C$DW$443       .dwtag  DW_TAG_member
    4187                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$54)
    4188                      .dwattr $C$DW$443, DW_AT_name("Lr_H")
    4189                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_Lr_H")
    4190                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4191                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4192              
    4193              $C$DW$444       .dwtag  DW_TAG_member
    4194                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$54)
    4195                      .dwattr $C$DW$444, DW_AT_name("Ls_d_H")
    4196                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_Ls_d_H")
    4197                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4198                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4199              
    4200              $C$DW$445       .dwtag  DW_TAG_member
    4201                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$54)
    4202                      .dwattr $C$DW$445, DW_AT_name("Ls_q_H")
    4203                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_Ls_q_H")
    4204                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4205                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4206              
    4207              $C$DW$446       .dwtag  DW_TAG_member
    4208                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$54)
    4209                      .dwattr $C$DW$446, DW_AT_name("Rr_Ohm")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   82

    4210                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_Rr_Ohm")
    4211                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4212                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4213              
    4214              $C$DW$447       .dwtag  DW_TAG_member
    4215                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$54)
    4216                      .dwattr $C$DW$447, DW_AT_name("Rs_Ohm")
    4217                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_Rs_Ohm")
    4218                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4219                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4220              
    4221              $C$DW$448       .dwtag  DW_TAG_member
    4222                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$54)
    4223                      .dwattr $C$DW$448, DW_AT_name("ratedFlux_VpHz")
    4224                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    4225                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4226                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4227              
    4228                      .dwendtag $C$DW$T$66
    4229              
    4230              $C$DW$T$49      .dwtag  DW_TAG_typedef
    4231                      .dwattr $C$DW$T$49, DW_AT_name("MOTOR_Params")
    4232                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    4233                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4234              
    4235              
    4236              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4237                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    4238                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    4239              $C$DW$449       .dwtag  DW_TAG_member
    4240                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    4241                      .dwattr $C$DW$449, DW_AT_name("sinTh")
    4242                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_sinTh")
    4243                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4244                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4245              
    4246              $C$DW$450       .dwtag  DW_TAG_member
    4247                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
    4248                      .dwattr $C$DW$450, DW_AT_name("cosTh")
    4249                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_cosTh")
    4250                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4251                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4252              
    4253                      .dwendtag $C$DW$T$67
    4254              
    4255              $C$DW$T$36      .dwtag  DW_TAG_typedef
    4256                      .dwattr $C$DW$T$36, DW_AT_name("PARK_Obj")
    4257                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    4258                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4259              
    4260              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4261                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    4262                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    4263              
    4264              $C$DW$T$35      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   83

    4265                      .dwattr $C$DW$T$35, DW_AT_name("PARK_Handle")
    4266                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4267                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4268              
    4269              
    4270              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    4271                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    4272                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    4273              $C$DW$451       .dwtag  DW_TAG_member
    4274                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    4275                      .dwattr $C$DW$451, DW_AT_name("Kp")
    4276                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_Kp")
    4277                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4278                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4279              
    4280              $C$DW$452       .dwtag  DW_TAG_member
    4281                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    4282                      .dwattr $C$DW$452, DW_AT_name("Ki")
    4283                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_Ki")
    4284                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4285                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4286              
    4287              $C$DW$453       .dwtag  DW_TAG_member
    4288                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    4289                      .dwattr $C$DW$453, DW_AT_name("Kd")
    4290                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_Kd")
    4291                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4292                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4293              
    4294              $C$DW$454       .dwtag  DW_TAG_member
    4295                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    4296                      .dwattr $C$DW$454, DW_AT_name("Ui")
    4297                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_Ui")
    4298                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4299                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4300              
    4301              $C$DW$455       .dwtag  DW_TAG_member
    4302                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    4303                      .dwattr $C$DW$455, DW_AT_name("refValue")
    4304                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_refValue")
    4305                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4306                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4307              
    4308              $C$DW$456       .dwtag  DW_TAG_member
    4309                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    4310                      .dwattr $C$DW$456, DW_AT_name("fbackValue")
    4311                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_fbackValue")
    4312                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4313                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4314              
    4315              $C$DW$457       .dwtag  DW_TAG_member
    4316                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    4317                      .dwattr $C$DW$457, DW_AT_name("outMin")
    4318                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_outMin")
    4319                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   84

    4320                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4321              
    4322              $C$DW$458       .dwtag  DW_TAG_member
    4323                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    4324                      .dwattr $C$DW$458, DW_AT_name("outMax")
    4325                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_outMax")
    4326                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4327                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4328              
    4329                      .dwendtag $C$DW$T$68
    4330              
    4331              $C$DW$T$39      .dwtag  DW_TAG_typedef
    4332                      .dwattr $C$DW$T$39, DW_AT_name("PID_Obj")
    4333                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    4334                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4335              
    4336              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4337                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    4338                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    4339              
    4340              $C$DW$T$38      .dwtag  DW_TAG_typedef
    4341                      .dwattr $C$DW$T$38, DW_AT_name("PID_Handle")
    4342                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4343                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4344              
    4345              
    4346              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    4347                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    4348                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    4349              $C$DW$459       .dwtag  DW_TAG_member
    4350                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$20)
    4351                      .dwattr $C$DW$459, DW_AT_name("maxModulation")
    4352                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_maxModulation")
    4353                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4354                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4355              
    4356                      .dwendtag $C$DW$T$69
    4357              
    4358              $C$DW$T$45      .dwtag  DW_TAG_typedef
    4359                      .dwattr $C$DW$T$45, DW_AT_name("SVGEN_Obj")
    4360                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    4361                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4362              
    4363              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4364                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    4365                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4366              
    4367              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4368                      .dwattr $C$DW$T$44, DW_AT_name("SVGEN_Handle")
    4369                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4370                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4371              
    4372              
    4373              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4374                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   85

    4375                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4376              $C$DW$460       .dwtag  DW_TAG_member
    4377                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    4378                      .dwattr $C$DW$460, DW_AT_name("targetValue")
    4379                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_targetValue")
    4380                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4381                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4382              
    4383              $C$DW$461       .dwtag  DW_TAG_member
    4384                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    4385                      .dwattr $C$DW$461, DW_AT_name("intValue")
    4386                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_intValue")
    4387                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4388                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4389              
    4390              $C$DW$462       .dwtag  DW_TAG_member
    4391                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    4392                      .dwattr $C$DW$462, DW_AT_name("minValue")
    4393                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_minValue")
    4394                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4395                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4396              
    4397              $C$DW$463       .dwtag  DW_TAG_member
    4398                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$20)
    4399                      .dwattr $C$DW$463, DW_AT_name("maxValue")
    4400                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_maxValue")
    4401                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4402                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4403              
    4404              $C$DW$464       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
    4406                      .dwattr $C$DW$464, DW_AT_name("maxDelta")
    4407                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_maxDelta")
    4408                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4409                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4410              
    4411                      .dwendtag $C$DW$T$70
    4412              
    4413              $C$DW$T$48      .dwtag  DW_TAG_typedef
    4414                      .dwattr $C$DW$T$48, DW_AT_name("TRAJ_Obj")
    4415                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    4416                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4417              
    4418              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4419                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    4420                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4421              
    4422              $C$DW$T$47      .dwtag  DW_TAG_typedef
    4423                      .dwattr $C$DW$T$47, DW_AT_name("TRAJ_Handle")
    4424                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4425                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4426              
    4427              
    4428              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4429                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   86

    4430                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    4431              $C$DW$465       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    4433                      .dwattr $C$DW$465, DW_AT_name("iqFullScaleCurrent_A")
    4434                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    4435                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4436                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4437              
    4438              $C$DW$466       .dwtag  DW_TAG_member
    4439                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    4440                      .dwattr $C$DW$466, DW_AT_name("iqFullScaleVoltage_V")
    4441                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    4442                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4443                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4444              
    4445              $C$DW$467       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    4447                      .dwattr $C$DW$467, DW_AT_name("iqFullScaleFreq_Hz")
    4448                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    4449                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4450                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4451              
    4452              $C$DW$468       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$53)
    4454                      .dwattr $C$DW$468, DW_AT_name("numIsrTicksPerCtrlTick")
    4455                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4456                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4457                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4458              
    4459              $C$DW$469       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$53)
    4461                      .dwattr $C$DW$469, DW_AT_name("numCtrlTicksPerCurrentTick")
    4462                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4463                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4464                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4465              
    4466              $C$DW$470       .dwtag  DW_TAG_member
    4467                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$53)
    4468                      .dwattr $C$DW$470, DW_AT_name("numCtrlTicksPerEstTick")
    4469                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    4470                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4471                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4472              
    4473              $C$DW$471       .dwtag  DW_TAG_member
    4474                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$53)
    4475                      .dwattr $C$DW$471, DW_AT_name("numCtrlTicksPerSpeedTick")
    4476                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4477                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4478                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4479              
    4480              $C$DW$472       .dwtag  DW_TAG_member
    4481                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$53)
    4482                      .dwattr $C$DW$472, DW_AT_name("numCtrlTicksPerTrajTick")
    4483                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4484                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   87

    4485                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4486              
    4487              $C$DW$473       .dwtag  DW_TAG_member
    4488                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$22)
    4489                      .dwattr $C$DW$473, DW_AT_name("numCurrentSensors")
    4490                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_numCurrentSensors")
    4491                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4492                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4493              
    4494              $C$DW$474       .dwtag  DW_TAG_member
    4495                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$22)
    4496                      .dwattr $C$DW$474, DW_AT_name("numVoltageSensors")
    4497                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_numVoltageSensors")
    4498                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4499                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4500              
    4501              $C$DW$475       .dwtag  DW_TAG_member
    4502                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$54)
    4503                      .dwattr $C$DW$475, DW_AT_name("offsetPole_rps")
    4504                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_offsetPole_rps")
    4505                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4506                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4507              
    4508              $C$DW$476       .dwtag  DW_TAG_member
    4509                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$54)
    4510                      .dwattr $C$DW$476, DW_AT_name("fluxPole_rps")
    4511                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_fluxPole_rps")
    4512                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4513                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4514              
    4515              $C$DW$477       .dwtag  DW_TAG_member
    4516                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$54)
    4517                      .dwattr $C$DW$477, DW_AT_name("zeroSpeedLimit")
    4518                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    4519                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4520                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4521              
    4522              $C$DW$478       .dwtag  DW_TAG_member
    4523                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$54)
    4524                      .dwattr $C$DW$478, DW_AT_name("forceAngleFreq_Hz")
    4525                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    4526                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4527                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4528              
    4529              $C$DW$479       .dwtag  DW_TAG_member
    4530                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$54)
    4531                      .dwattr $C$DW$479, DW_AT_name("maxAccel_Hzps")
    4532                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    4533                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4534                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4535              
    4536              $C$DW$480       .dwtag  DW_TAG_member
    4537                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$54)
    4538                      .dwattr $C$DW$480, DW_AT_name("maxAccel_est_Hzps")
    4539                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   88

    4540                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4541                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4542              
    4543              $C$DW$481       .dwtag  DW_TAG_member
    4544                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$54)
    4545                      .dwattr $C$DW$481, DW_AT_name("directionPole_rps")
    4546                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_directionPole_rps")
    4547                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4548                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4549              
    4550              $C$DW$482       .dwtag  DW_TAG_member
    4551                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$54)
    4552                      .dwattr $C$DW$482, DW_AT_name("speedPole_rps")
    4553                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_speedPole_rps")
    4554                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4555                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4556              
    4557              $C$DW$483       .dwtag  DW_TAG_member
    4558                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$54)
    4559                      .dwattr $C$DW$483, DW_AT_name("dcBusPole_rps")
    4560                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4561                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4562                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4563              
    4564              $C$DW$484       .dwtag  DW_TAG_member
    4565                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    4566                      .dwattr $C$DW$484, DW_AT_name("fluxFraction")
    4567                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_fluxFraction")
    4568                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4569                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4570              
    4571              $C$DW$485       .dwtag  DW_TAG_member
    4572                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$54)
    4573                      .dwattr $C$DW$485, DW_AT_name("indEst_speedMaxFraction")
    4574                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4575                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4576                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4577              
    4578              $C$DW$486       .dwtag  DW_TAG_member
    4579                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$54)
    4580                      .dwattr $C$DW$486, DW_AT_name("powerWarpGain")
    4581                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_powerWarpGain")
    4582                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4583                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4584              
    4585              $C$DW$487       .dwtag  DW_TAG_member
    4586                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$53)
    4587                      .dwattr $C$DW$487, DW_AT_name("systemFreq_MHz")
    4588                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4589                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4590                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4591              
    4592              $C$DW$488       .dwtag  DW_TAG_member
    4593                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$54)
    4594                      .dwattr $C$DW$488, DW_AT_name("pwmPeriod_usec")
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   89

    4595                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4596                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4597                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4598              
    4599              $C$DW$489       .dwtag  DW_TAG_member
    4600                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$54)
    4601                      .dwattr $C$DW$489, DW_AT_name("voltage_sf")
    4602                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_voltage_sf")
    4603                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4604                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4605              
    4606              $C$DW$490       .dwtag  DW_TAG_member
    4607                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$54)
    4608                      .dwattr $C$DW$490, DW_AT_name("current_sf")
    4609                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_current_sf")
    4610                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4611                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4612              
    4613              $C$DW$491       .dwtag  DW_TAG_member
    4614                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$54)
    4615                      .dwattr $C$DW$491, DW_AT_name("voltageFilterPole_rps")
    4616                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4617                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4618                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4619              
    4620              $C$DW$492       .dwtag  DW_TAG_member
    4621                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$54)
    4622                      .dwattr $C$DW$492, DW_AT_name("maxVsMag_pu")
    4623                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4624                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4625                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4626              
    4627              $C$DW$493       .dwtag  DW_TAG_member
    4628                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$54)
    4629                      .dwattr $C$DW$493, DW_AT_name("estKappa")
    4630                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_estKappa")
    4631                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4632                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4633              
    4634              $C$DW$494       .dwtag  DW_TAG_member
    4635                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$65)
    4636                      .dwattr $C$DW$494, DW_AT_name("motor_type")
    4637                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_motor_type")
    4638                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4639                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4640              
    4641              $C$DW$495       .dwtag  DW_TAG_member
    4642                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$53)
    4643                      .dwattr $C$DW$495, DW_AT_name("motor_numPolePairs")
    4644                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4645                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4646                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4647              
    4648              $C$DW$496       .dwtag  DW_TAG_member
    4649                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v16.9.1 Wed Jan 04 15:50:45 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\ROSSYE~1\AppData\Local\Temp\0488010                         PAGE   90

    4650                      .dwattr $C$DW$496, DW_AT_name("motor_ratedFlux")
    4651                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4652                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4653                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4654              
    4655              $C$DW$497       .dwtag  DW_TAG_member
    4656                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$54)
    4657                      .dwattr $C$DW$497, DW_AT_name("motor_Rr")
    4658                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_motor_Rr")
    4659                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4660                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4661              
    4662              $C$DW$498       .dwtag  DW_TAG_member
    4663                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    4664                      .dwattr $C$DW$498, DW_AT_name("motor_Rs")
    4665                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_motor_Rs")
    4666                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4667                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4668              
    4669              $C$DW$499       .dwtag  DW_TAG_member
    4670                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
